/* automatically generated by rust-bindgen 0.60.1 */

pub const MA_VERSION_MAJOR: u32 = 0;
pub const MA_VERSION_MINOR: u32 = 10;
pub const MA_VERSION_REVISION: u32 = 31;
pub const MA_TRUE: u32 = 1;
pub const MA_FALSE: u32 = 0;
pub const MA_SIZE_MAX: u32 = 4294967295;
pub const MA_SIMD_ALIGNMENT: u32 = 64;
pub const MA_LOG_LEVEL_VERBOSE: u32 = 4;
pub const MA_LOG_LEVEL_INFO: u32 = 3;
pub const MA_LOG_LEVEL_WARNING: u32 = 2;
pub const MA_LOG_LEVEL_ERROR: u32 = 1;
pub const MA_LOG_LEVEL: u32 = 1;
pub const MA_CHANNEL_NONE: u32 = 0;
pub const MA_CHANNEL_MONO: u32 = 1;
pub const MA_CHANNEL_FRONT_LEFT: u32 = 2;
pub const MA_CHANNEL_FRONT_RIGHT: u32 = 3;
pub const MA_CHANNEL_FRONT_CENTER: u32 = 4;
pub const MA_CHANNEL_LFE: u32 = 5;
pub const MA_CHANNEL_BACK_LEFT: u32 = 6;
pub const MA_CHANNEL_BACK_RIGHT: u32 = 7;
pub const MA_CHANNEL_FRONT_LEFT_CENTER: u32 = 8;
pub const MA_CHANNEL_FRONT_RIGHT_CENTER: u32 = 9;
pub const MA_CHANNEL_BACK_CENTER: u32 = 10;
pub const MA_CHANNEL_SIDE_LEFT: u32 = 11;
pub const MA_CHANNEL_SIDE_RIGHT: u32 = 12;
pub const MA_CHANNEL_TOP_CENTER: u32 = 13;
pub const MA_CHANNEL_TOP_FRONT_LEFT: u32 = 14;
pub const MA_CHANNEL_TOP_FRONT_CENTER: u32 = 15;
pub const MA_CHANNEL_TOP_FRONT_RIGHT: u32 = 16;
pub const MA_CHANNEL_TOP_BACK_LEFT: u32 = 17;
pub const MA_CHANNEL_TOP_BACK_CENTER: u32 = 18;
pub const MA_CHANNEL_TOP_BACK_RIGHT: u32 = 19;
pub const MA_CHANNEL_AUX_0: u32 = 20;
pub const MA_CHANNEL_AUX_1: u32 = 21;
pub const MA_CHANNEL_AUX_2: u32 = 22;

pub const MA_PROTOCOL_UNAVAILABLE: i32 = -40;
pub const MA_PROTOCOL_NOT_SUPPORTED: i32 = -41;
pub const MA_PROTOCOL_FAMILY_NOT_SUPPORTED: i32 = -42;
pub const MA_ADDRESS_FAMILY_NOT_SUPPORTED: i32 = -43;
pub const MA_SOCKET_NOT_SUPPORTED: i32 = -44;
pub const MA_CONNECTION_RESET: i32 = -45;
pub const MA_ALREADY_CONNECTED: i32 = -46;
pub const MA_NOT_CONNECTED: i32 = -47;
pub const MA_CONNECTION_REFUSED: i32 = -48;
pub const MA_NO_HOST: i32 = -49;
pub const MA_IN_PROGRESS: i32 = -50;
pub const MA_CANCELLED: i32 = -51;
pub const MA_MEMORY_ALREADY_MAPPED: i32 = -52;
pub const MA_AT_END: i32 = -53;
pub const MA_FORMAT_NOT_SUPPORTED: i32 = -100;
pub const MA_DEVICE_TYPE_NOT_SUPPORTED: i32 = -101;
pub const MA_SHARE_MODE_NOT_SUPPORTED: i32 = -102;
pub const MA_NO_BACKEND: i32 = -103;
pub const MA_NO_DEVICE: i32 = -104;
pub const MA_API_NOT_FOUND: i32 = -105;
pub const MA_INVALID_DEVICE_CONFIG: i32 = -106;
pub const MA_LOOP: i32 = -107;
pub const MA_DEVICE_NOT_INITIALIZED: i32 = -200;
pub const MA_DEVICE_ALREADY_INITIALIZED: i32 = -201;
pub const MA_DEVICE_NOT_STARTED: i32 = -202;
pub const MA_DEVICE_NOT_STOPPED: i32 = -203;
pub const MA_FAILED_TO_INIT_BACKEND: i32 = -300;
pub const MA_FAILED_TO_OPEN_BACKEND_DEVICE: i32 = -301;
pub const MA_FAILED_TO_START_BACKEND_DEVICE: i32 = -302;
pub const MA_FAILED_TO_STOP_BACKEND_DEVICE: i32 = -303;
pub const MA_SAMPLE_RATE_8000: u32 = 8000;
pub const MA_SAMPLE_RATE_11025: u32 = 11025;
pub const MA_SAMPLE_RATE_16000: u32 = 16000;
pub const MA_SAMPLE_RATE_22050: u32 = 22050;
pub const MA_SAMPLE_RATE_24000: u32 = 24000;
pub const MA_SAMPLE_RATE_32000: u32 = 32000;
pub const MA_SAMPLE_RATE_44100: u32 = 44100;
pub const MA_SAMPLE_RATE_48000: u32 = 48000;
pub const MA_SAMPLE_RATE_88200: u32 = 88200;
pub const MA_SAMPLE_RATE_96000: u32 = 96000;
pub const MA_SAMPLE_RATE_176400: u32 = 176400;
pub const MA_SAMPLE_RATE_192000: u32 = 192000;
pub const MA_SAMPLE_RATE_352800: u32 = 352800;
pub const MA_SAMPLE_RATE_384000: u32 = 384000;
pub const MA_MIN_CHANNELS: u32 = 1;
pub const MA_MAX_CHANNELS: u32 = 32;
pub const MA_MIN_SAMPLE_RATE: u32 = 8000;
pub const MA_MAX_SAMPLE_RATE: u32 = 384000;
pub const MA_MAX_FILTER_ORDER: u32 = 8;
pub const MA_STATE_UNINITIALIZED: u32 = 0;
pub const MA_STATE_STOPPED: u32 = 1;
pub const MA_STATE_STARTED: u32 = 2;
pub const MA_STATE_STARTING: u32 = 3;
pub const MA_STATE_STOPPING: u32 = 4;
pub const MA_DATA_FORMAT_FLAG_EXCLUSIVE_MODE: u32 = 2;
pub const MA_OPEN_MODE_READ: u32 = 1;
pub const MA_OPEN_MODE_WRITE: u32 = 2;
pub type __darwin_size_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[test]
fn bindgen_test_layout___darwin_pthread_handler_rec() {
    assert_eq!(
        ::std::mem::size_of::<__darwin_pthread_handler_rec>(),
        24usize,
        concat!("Size of: ", stringify!(__darwin_pthread_handler_rec))
    );
    assert_eq!(
        ::std::mem::align_of::<__darwin_pthread_handler_rec>(),
        8usize,
        concat!("Alignment of ", stringify!(__darwin_pthread_handler_rec))
    );
    fn test_field___routine() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__darwin_pthread_handler_rec>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__routine) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__darwin_pthread_handler_rec),
                "::",
                stringify!(__routine)
            )
        );
    }
    test_field___routine();
    fn test_field___arg() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__darwin_pthread_handler_rec>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__arg) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(__darwin_pthread_handler_rec),
                "::",
                stringify!(__arg)
            )
        );
    }
    test_field___arg();
    fn test_field___next() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__darwin_pthread_handler_rec>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(__darwin_pthread_handler_rec),
                "::",
                stringify!(__next)
            )
        );
    }
    test_field___next();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _opaque_pthread_cond_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 40usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_cond_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(_opaque_pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_cond_t))
    );
    fn test_field___sig() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_opaque_pthread_cond_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_opaque_pthread_cond_t),
                "::",
                stringify!(__sig)
            )
        );
    }
    test_field___sig();
    fn test_field___opaque() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_opaque_pthread_cond_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_opaque_pthread_cond_t),
                "::",
                stringify!(__opaque)
            )
        );
    }
    test_field___opaque();
}
impl ::std::fmt::Debug for _opaque_pthread_cond_t {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "_opaque_pthread_cond_t {{ __sig: {:?}, __opaque: [{}] }}",
            self.__sig,
            self.__opaque
                .iter()
                .enumerate()
                .map(|(i, v)| format!("{}{:?}", if i > 0 { ", " } else { "" }, v))
                .collect::<String>()
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutex_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_mutex_t>(),
        64usize,
        concat!("Size of: ", stringify!(_opaque_pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_mutex_t))
    );
    fn test_field___sig() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_opaque_pthread_mutex_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_opaque_pthread_mutex_t),
                "::",
                stringify!(__sig)
            )
        );
    }
    test_field___sig();
    fn test_field___opaque() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_opaque_pthread_mutex_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_opaque_pthread_mutex_t),
                "::",
                stringify!(__opaque)
            )
        );
    }
    test_field___opaque();
}
impl ::std::fmt::Debug for _opaque_pthread_mutex_t {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "_opaque_pthread_mutex_t {{ __sig: {:?}, __opaque: [{}] }}",
            self.__sig,
            self.__opaque
                .iter()
                .enumerate()
                .map(|(i, v)| format!("{}{:?}", if i > 0 { ", " } else { "" }, v))
                .collect::<String>()
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _opaque_pthread_t {
    pub __sig: ::std::os::raw::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [::std::os::raw::c_char; 8176usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_t>(),
        8192usize,
        concat!("Size of: ", stringify!(_opaque_pthread_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_t))
    );
    fn test_field___sig() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_opaque_pthread_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_opaque_pthread_t),
                "::",
                stringify!(__sig)
            )
        );
    }
    test_field___sig();
    fn test_field___cleanup_stack() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_opaque_pthread_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__cleanup_stack) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_opaque_pthread_t),
                "::",
                stringify!(__cleanup_stack)
            )
        );
    }
    test_field___cleanup_stack();
    fn test_field___opaque() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_opaque_pthread_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(_opaque_pthread_t),
                "::",
                stringify!(__opaque)
            )
        );
    }
    test_field___opaque();
}
impl ::std::fmt::Debug for _opaque_pthread_t {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "_opaque_pthread_t {{ __sig: {:?}, __cleanup_stack: {:?}, __opaque: [{}] }}",
            self.__sig,
            self.__cleanup_stack,
            self.__opaque
                .iter()
                .enumerate()
                .map(|(i, v)| format!("{}{:?}", if i > 0 { ", " } else { "" }, v))
                .collect::<String>()
        )
    }
}
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type pthread_cond_t = __darwin_pthread_cond_t;
pub type pthread_mutex_t = __darwin_pthread_mutex_t;
pub type pthread_t = __darwin_pthread_t;
pub type wchar_t = ::std::os::raw::c_int;
pub type ma_int8 = ::std::os::raw::c_schar;
pub type ma_uint8 = ::std::os::raw::c_uchar;
pub type ma_int16 = ::std::os::raw::c_short;
pub type ma_uint16 = ::std::os::raw::c_ushort;
pub type ma_int32 = ::std::os::raw::c_int;
pub type ma_uint32 = ::std::os::raw::c_uint;
pub type ma_int64 = ::std::os::raw::c_longlong;
pub type ma_uint64 = ::std::os::raw::c_ulonglong;
pub type ma_uintptr = ma_uint64;
pub type ma_bool8 = ma_uint8;
pub type ma_bool32 = ma_uint32;
pub type ma_handle = *mut ::std::os::raw::c_void;
pub type ma_ptr = *mut ::std::os::raw::c_void;
pub type ma_proc = ::std::option::Option<unsafe extern "C" fn()>;
pub type ma_channel = ma_uint8;
pub type ma_result = ::std::os::raw::c_int;
pub const ma_stream_format_pcm: ma_stream_format = 0;
pub type ma_stream_format = ::std::os::raw::c_uint;
pub const ma_stream_layout_interleaved: ma_stream_layout = 0;
pub const ma_stream_layout_deinterleaved: ma_stream_layout = 1;
pub type ma_stream_layout = ::std::os::raw::c_uint;
pub const ma_dither_mode_none: ma_dither_mode = 0;
pub const ma_dither_mode_rectangle: ma_dither_mode = 1;
pub const ma_dither_mode_triangle: ma_dither_mode = 2;
pub type ma_dither_mode = ::std::os::raw::c_uint;
pub const ma_format_unknown: ma_format = 0;
pub const ma_format_u8: ma_format = 1;
pub const ma_format_s16: ma_format = 2;
pub const ma_format_s24: ma_format = 3;
pub const ma_format_s32: ma_format = 4;
pub const ma_format_f32: ma_format = 5;
pub const ma_format_count: ma_format = 6;
pub type ma_format = ::std::os::raw::c_uint;
pub const ma_channel_mix_mode_rectangular: ma_channel_mix_mode = 0;
pub const ma_channel_mix_mode_simple: ma_channel_mix_mode = 1;
pub const ma_channel_mix_mode_custom_weights: ma_channel_mix_mode = 2;
pub const ma_channel_mix_mode_planar_blend: ma_channel_mix_mode = 0;
pub const ma_channel_mix_mode_default: ma_channel_mix_mode = 0;
pub type ma_channel_mix_mode = ::std::os::raw::c_uint;
pub const ma_standard_channel_map_microsoft: ma_standard_channel_map = 0;
pub const ma_standard_channel_map_alsa: ma_standard_channel_map = 1;
pub const ma_standard_channel_map_rfc3551: ma_standard_channel_map = 2;
pub const ma_standard_channel_map_flac: ma_standard_channel_map = 3;
pub const ma_standard_channel_map_vorbis: ma_standard_channel_map = 4;
pub const ma_standard_channel_map_sound4: ma_standard_channel_map = 5;
pub const ma_standard_channel_map_sndio: ma_standard_channel_map = 6;
pub const ma_standard_channel_map_webaudio: ma_standard_channel_map = 3;
pub const ma_standard_channel_map_default: ma_standard_channel_map = 0;
pub type ma_standard_channel_map = ::std::os::raw::c_uint;
pub const ma_performance_profile_low_latency: ma_performance_profile = 0;
pub const ma_performance_profile_conservative: ma_performance_profile = 1;
pub type ma_performance_profile = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_allocation_callbacks {
    pub pUserData: *mut ::std::os::raw::c_void,
    pub onMalloc: ::std::option::Option<
        unsafe extern "C" fn(
            sz: usize,
            pUserData: *mut ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub onRealloc: ::std::option::Option<
        unsafe extern "C" fn(
            p: *mut ::std::os::raw::c_void,
            sz: usize,
            pUserData: *mut ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub onFree: ::std::option::Option<
        unsafe extern "C" fn(
            p: *mut ::std::os::raw::c_void,
            pUserData: *mut ::std::os::raw::c_void,
        ),
    >,
}
#[test]
fn bindgen_test_layout_ma_allocation_callbacks() {
    assert_eq!(
        ::std::mem::size_of::<ma_allocation_callbacks>(),
        32usize,
        concat!("Size of: ", stringify!(ma_allocation_callbacks))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_allocation_callbacks>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_allocation_callbacks))
    );
    fn test_field_pUserData() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_allocation_callbacks>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pUserData) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_allocation_callbacks),
                "::",
                stringify!(pUserData)
            )
        );
    }
    test_field_pUserData();
    fn test_field_onMalloc() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_allocation_callbacks>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).onMalloc) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_allocation_callbacks),
                "::",
                stringify!(onMalloc)
            )
        );
    }
    test_field_onMalloc();
    fn test_field_onRealloc() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_allocation_callbacks>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).onRealloc) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_allocation_callbacks),
                "::",
                stringify!(onRealloc)
            )
        );
    }
    test_field_onRealloc();
    fn test_field_onFree() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_allocation_callbacks>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).onFree) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_allocation_callbacks),
                "::",
                stringify!(onFree)
            )
        );
    }
    test_field_onFree();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_lcg {
    pub state: ma_int32,
}
#[test]
fn bindgen_test_layout_ma_lcg() {
    assert_eq!(
        ::std::mem::size_of::<ma_lcg>(),
        4usize,
        concat!("Size of: ", stringify!(ma_lcg))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_lcg>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_lcg))
    );
    fn test_field_state() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_lcg>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_lcg),
                "::",
                stringify!(state)
            )
        );
    }
    test_field_state();
}
pub const ma_thread_priority_idle: ma_thread_priority = -5;
pub const ma_thread_priority_lowest: ma_thread_priority = -4;
pub const ma_thread_priority_low: ma_thread_priority = -3;
pub const ma_thread_priority_normal: ma_thread_priority = -2;
pub const ma_thread_priority_high: ma_thread_priority = -1;
pub const ma_thread_priority_highest: ma_thread_priority = 0;
pub const ma_thread_priority_realtime: ma_thread_priority = 1;
pub const ma_thread_priority_default: ma_thread_priority = 0;
pub type ma_thread_priority = ::std::os::raw::c_int;
pub type ma_spinlock = ::std::os::raw::c_uchar;
pub type ma_thread = pthread_t;
pub type ma_mutex = pthread_mutex_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_event {
    pub value: ma_uint32,
    pub lock: pthread_mutex_t,
    pub cond: pthread_cond_t,
}
#[test]
fn bindgen_test_layout_ma_event() {
    assert_eq!(
        ::std::mem::size_of::<ma_event>(),
        120usize,
        concat!("Size of: ", stringify!(ma_event))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_event>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_event))
    );
    fn test_field_value() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_event>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_event),
                "::",
                stringify!(value)
            )
        );
    }
    test_field_value();
    fn test_field_lock() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_event>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).lock) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_event),
                "::",
                stringify!(lock)
            )
        );
    }
    test_field_lock();
    fn test_field_cond() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_event>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cond) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_event),
                "::",
                stringify!(cond)
            )
        );
    }
    test_field_cond();
}
impl ::std::fmt::Debug for ma_event {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "ma_event {{ value: {:?}, lock: {:?}, cond: {:?} }}",
            self.value, self.lock, self.cond
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_semaphore {
    pub value: ::std::os::raw::c_int,
    pub lock: pthread_mutex_t,
    pub cond: pthread_cond_t,
}
#[test]
fn bindgen_test_layout_ma_semaphore() {
    assert_eq!(
        ::std::mem::size_of::<ma_semaphore>(),
        120usize,
        concat!("Size of: ", stringify!(ma_semaphore))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_semaphore>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_semaphore))
    );
    fn test_field_value() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_semaphore>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_semaphore),
                "::",
                stringify!(value)
            )
        );
    }
    test_field_value();
    fn test_field_lock() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_semaphore>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).lock) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_semaphore),
                "::",
                stringify!(lock)
            )
        );
    }
    test_field_lock();
    fn test_field_cond() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_semaphore>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cond) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_semaphore),
                "::",
                stringify!(cond)
            )
        );
    }
    test_field_cond();
}
impl ::std::fmt::Debug for ma_semaphore {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "ma_semaphore {{ value: {:?}, lock: {:?}, cond: {:?} }}",
            self.value, self.lock, self.cond
        )
    }
}
extern "C" {
    pub fn ma_version(pMajor: *mut ma_uint32, pMinor: *mut ma_uint32, pRevision: *mut ma_uint32);
}
extern "C" {
    pub fn ma_version_string() -> *const ::std::os::raw::c_char;
}
#[doc = "Biquad Filtering"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_biquad_coefficient {
    pub f32_: f32,
    pub s32: ma_int32,
}
#[test]
fn bindgen_test_layout_ma_biquad_coefficient() {
    assert_eq!(
        ::std::mem::size_of::<ma_biquad_coefficient>(),
        4usize,
        concat!("Size of: ", stringify!(ma_biquad_coefficient))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_biquad_coefficient>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_biquad_coefficient))
    );
    fn test_field_f32() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_biquad_coefficient>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).f32_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_biquad_coefficient),
                "::",
                stringify!(f32_)
            )
        );
    }
    test_field_f32();
    fn test_field_s32() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_biquad_coefficient>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).s32) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_biquad_coefficient),
                "::",
                stringify!(s32)
            )
        );
    }
    test_field_s32();
}
impl ::std::fmt::Debug for ma_biquad_coefficient {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "ma_biquad_coefficient {{ union }}")
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_biquad_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub b0: f64,
    pub b1: f64,
    pub b2: f64,
    pub a0: f64,
    pub a1: f64,
    pub a2: f64,
}
#[test]
fn bindgen_test_layout_ma_biquad_config() {
    assert_eq!(
        ::std::mem::size_of::<ma_biquad_config>(),
        56usize,
        concat!("Size of: ", stringify!(ma_biquad_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_biquad_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_biquad_config))
    );
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_biquad_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_biquad_config),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_channels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_biquad_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_biquad_config),
                "::",
                stringify!(channels)
            )
        );
    }
    test_field_channels();
    fn test_field_b0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_biquad_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).b0) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_biquad_config),
                "::",
                stringify!(b0)
            )
        );
    }
    test_field_b0();
    fn test_field_b1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_biquad_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).b1) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_biquad_config),
                "::",
                stringify!(b1)
            )
        );
    }
    test_field_b1();
    fn test_field_b2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_biquad_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).b2) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_biquad_config),
                "::",
                stringify!(b2)
            )
        );
    }
    test_field_b2();
    fn test_field_a0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_biquad_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).a0) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_biquad_config),
                "::",
                stringify!(a0)
            )
        );
    }
    test_field_a0();
    fn test_field_a1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_biquad_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).a1) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_biquad_config),
                "::",
                stringify!(a1)
            )
        );
    }
    test_field_a1();
    fn test_field_a2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_biquad_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).a2) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_biquad_config),
                "::",
                stringify!(a2)
            )
        );
    }
    test_field_a2();
}
extern "C" {
    pub fn ma_biquad_config_init(
        format: ma_format,
        channels: ma_uint32,
        b0: f64,
        b1: f64,
        b2: f64,
        a0: f64,
        a1: f64,
        a2: f64,
    ) -> ma_biquad_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_biquad {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub b0: ma_biquad_coefficient,
    pub b1: ma_biquad_coefficient,
    pub b2: ma_biquad_coefficient,
    pub a1: ma_biquad_coefficient,
    pub a2: ma_biquad_coefficient,
    pub r1: [ma_biquad_coefficient; 32usize],
    pub r2: [ma_biquad_coefficient; 32usize],
}
#[test]
fn bindgen_test_layout_ma_biquad() {
    assert_eq!(
        ::std::mem::size_of::<ma_biquad>(),
        284usize,
        concat!("Size of: ", stringify!(ma_biquad))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_biquad>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_biquad))
    );
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_biquad>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_biquad),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_channels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_biquad>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_biquad),
                "::",
                stringify!(channels)
            )
        );
    }
    test_field_channels();
    fn test_field_b0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_biquad>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).b0) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_biquad),
                "::",
                stringify!(b0)
            )
        );
    }
    test_field_b0();
    fn test_field_b1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_biquad>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).b1) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_biquad),
                "::",
                stringify!(b1)
            )
        );
    }
    test_field_b1();
    fn test_field_b2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_biquad>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).b2) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_biquad),
                "::",
                stringify!(b2)
            )
        );
    }
    test_field_b2();
    fn test_field_a1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_biquad>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).a1) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_biquad),
                "::",
                stringify!(a1)
            )
        );
    }
    test_field_a1();
    fn test_field_a2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_biquad>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).a2) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_biquad),
                "::",
                stringify!(a2)
            )
        );
    }
    test_field_a2();
    fn test_field_r1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_biquad>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).r1) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_biquad),
                "::",
                stringify!(r1)
            )
        );
    }
    test_field_r1();
    fn test_field_r2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_biquad>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).r2) as usize - ptr as usize
            },
            156usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_biquad),
                "::",
                stringify!(r2)
            )
        );
    }
    test_field_r2();
}
impl ::std::fmt::Debug for ma_biquad {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "ma_biquad {{ format: {:?}, channels: {:?}, b0: {:?}, b1: {:?}, b2: {:?}, a1: {:?}, a2: {:?}, r1: [{}], r2: [{}] }}" , self . format , self . channels , self . b0 , self . b1 , self . b2 , self . a1 , self . a2 , self . r1 . iter () . enumerate () . map (| (i , v) | format ! ("{}{:?}" , if i > 0 { ", " } else { "" } , v)) . collect :: < String > () , self . r2 . iter () . enumerate () . map (| (i , v) | format ! ("{}{:?}" , if i > 0 { ", " } else { "" } , v)) . collect :: < String > ())
    }
}
extern "C" {
    pub fn ma_biquad_init(pConfig: *const ma_biquad_config, pBQ: *mut ma_biquad) -> ma_result;
}
extern "C" {
    pub fn ma_biquad_reinit(pConfig: *const ma_biquad_config, pBQ: *mut ma_biquad) -> ma_result;
}
extern "C" {
    pub fn ma_biquad_process_pcm_frames(
        pBQ: *mut ma_biquad,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_biquad_get_latency(pBQ: *const ma_biquad) -> ma_uint32;
}
#[doc = "Low-Pass Filtering"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_lpf1_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub cutoffFrequency: f64,
    pub q: f64,
}
#[test]
fn bindgen_test_layout_ma_lpf1_config() {
    assert_eq!(
        ::std::mem::size_of::<ma_lpf1_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_lpf1_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_lpf1_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_lpf1_config))
    );
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_lpf1_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_lpf1_config),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_channels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_lpf1_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_lpf1_config),
                "::",
                stringify!(channels)
            )
        );
    }
    test_field_channels();
    fn test_field_sampleRate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_lpf1_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_lpf1_config),
                "::",
                stringify!(sampleRate)
            )
        );
    }
    test_field_sampleRate();
    fn test_field_cutoffFrequency() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_lpf1_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cutoffFrequency) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_lpf1_config),
                "::",
                stringify!(cutoffFrequency)
            )
        );
    }
    test_field_cutoffFrequency();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_lpf1_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_lpf1_config),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[doc = "Low-Pass Filtering"]
pub type ma_lpf2_config = ma_lpf1_config;
extern "C" {
    pub fn ma_lpf1_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
    ) -> ma_lpf1_config;
}
extern "C" {
    pub fn ma_lpf2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
        q: f64,
    ) -> ma_lpf2_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_lpf1 {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub a: ma_biquad_coefficient,
    pub r1: [ma_biquad_coefficient; 32usize],
}
#[test]
fn bindgen_test_layout_ma_lpf1() {
    assert_eq!(
        ::std::mem::size_of::<ma_lpf1>(),
        140usize,
        concat!("Size of: ", stringify!(ma_lpf1))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_lpf1>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_lpf1))
    );
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_lpf1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_lpf1),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_channels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_lpf1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_lpf1),
                "::",
                stringify!(channels)
            )
        );
    }
    test_field_channels();
    fn test_field_a() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_lpf1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).a) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_lpf1),
                "::",
                stringify!(a)
            )
        );
    }
    test_field_a();
    fn test_field_r1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_lpf1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).r1) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_lpf1),
                "::",
                stringify!(r1)
            )
        );
    }
    test_field_r1();
}
impl ::std::fmt::Debug for ma_lpf1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "ma_lpf1 {{ format: {:?}, channels: {:?}, a: {:?}, r1: [{}] }}",
            self.format,
            self.channels,
            self.a,
            self.r1
                .iter()
                .enumerate()
                .map(|(i, v)| format!("{}{:?}", if i > 0 { ", " } else { "" }, v))
                .collect::<String>()
        )
    }
}
extern "C" {
    pub fn ma_lpf1_init(pConfig: *const ma_lpf1_config, pLPF: *mut ma_lpf1) -> ma_result;
}
extern "C" {
    pub fn ma_lpf1_reinit(pConfig: *const ma_lpf1_config, pLPF: *mut ma_lpf1) -> ma_result;
}
extern "C" {
    pub fn ma_lpf1_process_pcm_frames(
        pLPF: *mut ma_lpf1,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf1_get_latency(pLPF: *const ma_lpf1) -> ma_uint32;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_lpf2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_lpf2() {
    assert_eq!(
        ::std::mem::size_of::<ma_lpf2>(),
        284usize,
        concat!("Size of: ", stringify!(ma_lpf2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_lpf2>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_lpf2))
    );
    fn test_field_bq() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_lpf2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bq) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_lpf2),
                "::",
                stringify!(bq)
            )
        );
    }
    test_field_bq();
}
impl ::std::fmt::Debug for ma_lpf2 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "ma_lpf2 {{ bq: {:?} }}", self.bq)
    }
}
extern "C" {
    pub fn ma_lpf2_init(pConfig: *const ma_lpf2_config, pLPF: *mut ma_lpf2) -> ma_result;
}
extern "C" {
    pub fn ma_lpf2_reinit(pConfig: *const ma_lpf2_config, pLPF: *mut ma_lpf2) -> ma_result;
}
extern "C" {
    pub fn ma_lpf2_process_pcm_frames(
        pLPF: *mut ma_lpf2,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf2_get_latency(pLPF: *const ma_lpf2) -> ma_uint32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_lpf_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub cutoffFrequency: f64,
    pub order: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_lpf_config() {
    assert_eq!(
        ::std::mem::size_of::<ma_lpf_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_lpf_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_lpf_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_lpf_config))
    );
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_lpf_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_lpf_config),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_channels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_lpf_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_lpf_config),
                "::",
                stringify!(channels)
            )
        );
    }
    test_field_channels();
    fn test_field_sampleRate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_lpf_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_lpf_config),
                "::",
                stringify!(sampleRate)
            )
        );
    }
    test_field_sampleRate();
    fn test_field_cutoffFrequency() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_lpf_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cutoffFrequency) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_lpf_config),
                "::",
                stringify!(cutoffFrequency)
            )
        );
    }
    test_field_cutoffFrequency();
    fn test_field_order() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_lpf_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).order) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_lpf_config),
                "::",
                stringify!(order)
            )
        );
    }
    test_field_order();
}
extern "C" {
    pub fn ma_lpf_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
        order: ma_uint32,
    ) -> ma_lpf_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_lpf {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub lpf1Count: ma_uint32,
    pub lpf2Count: ma_uint32,
    pub lpf1: [ma_lpf1; 1usize],
    pub lpf2: [ma_lpf2; 4usize],
}
#[test]
fn bindgen_test_layout_ma_lpf() {
    assert_eq!(
        ::std::mem::size_of::<ma_lpf>(),
        1296usize,
        concat!("Size of: ", stringify!(ma_lpf))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_lpf>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_lpf))
    );
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_lpf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_lpf),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_channels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_lpf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_lpf),
                "::",
                stringify!(channels)
            )
        );
    }
    test_field_channels();
    fn test_field_sampleRate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_lpf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_lpf),
                "::",
                stringify!(sampleRate)
            )
        );
    }
    test_field_sampleRate();
    fn test_field_lpf1Count() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_lpf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).lpf1Count) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_lpf),
                "::",
                stringify!(lpf1Count)
            )
        );
    }
    test_field_lpf1Count();
    fn test_field_lpf2Count() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_lpf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).lpf2Count) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_lpf),
                "::",
                stringify!(lpf2Count)
            )
        );
    }
    test_field_lpf2Count();
    fn test_field_lpf1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_lpf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).lpf1) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_lpf),
                "::",
                stringify!(lpf1)
            )
        );
    }
    test_field_lpf1();
    fn test_field_lpf2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_lpf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).lpf2) as usize - ptr as usize
            },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_lpf),
                "::",
                stringify!(lpf2)
            )
        );
    }
    test_field_lpf2();
}
impl ::std::fmt::Debug for ma_lpf {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "ma_lpf {{ format: {:?}, channels: {:?}, sampleRate: {:?}, lpf1Count: {:?}, lpf2Count: {:?}, lpf1: {:?}, lpf2: {:?} }}" , self . format , self . channels , self . sampleRate , self . lpf1Count , self . lpf2Count , self . lpf1 , self . lpf2)
    }
}
extern "C" {
    pub fn ma_lpf_init(pConfig: *const ma_lpf_config, pLPF: *mut ma_lpf) -> ma_result;
}
extern "C" {
    pub fn ma_lpf_reinit(pConfig: *const ma_lpf_config, pLPF: *mut ma_lpf) -> ma_result;
}
extern "C" {
    pub fn ma_lpf_process_pcm_frames(
        pLPF: *mut ma_lpf,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_lpf_get_latency(pLPF: *const ma_lpf) -> ma_uint32;
}
#[doc = "High-Pass Filtering"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_hpf1_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub cutoffFrequency: f64,
    pub q: f64,
}
#[test]
fn bindgen_test_layout_ma_hpf1_config() {
    assert_eq!(
        ::std::mem::size_of::<ma_hpf1_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_hpf1_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_hpf1_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_hpf1_config))
    );
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hpf1_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hpf1_config),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_channels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hpf1_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hpf1_config),
                "::",
                stringify!(channels)
            )
        );
    }
    test_field_channels();
    fn test_field_sampleRate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hpf1_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hpf1_config),
                "::",
                stringify!(sampleRate)
            )
        );
    }
    test_field_sampleRate();
    fn test_field_cutoffFrequency() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hpf1_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cutoffFrequency) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hpf1_config),
                "::",
                stringify!(cutoffFrequency)
            )
        );
    }
    test_field_cutoffFrequency();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hpf1_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hpf1_config),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
#[doc = "High-Pass Filtering"]
pub type ma_hpf2_config = ma_hpf1_config;
extern "C" {
    pub fn ma_hpf1_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
    ) -> ma_hpf1_config;
}
extern "C" {
    pub fn ma_hpf2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
        q: f64,
    ) -> ma_hpf2_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_hpf1 {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub a: ma_biquad_coefficient,
    pub r1: [ma_biquad_coefficient; 32usize],
}
#[test]
fn bindgen_test_layout_ma_hpf1() {
    assert_eq!(
        ::std::mem::size_of::<ma_hpf1>(),
        140usize,
        concat!("Size of: ", stringify!(ma_hpf1))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_hpf1>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_hpf1))
    );
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hpf1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hpf1),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_channels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hpf1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hpf1),
                "::",
                stringify!(channels)
            )
        );
    }
    test_field_channels();
    fn test_field_a() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hpf1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).a) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hpf1),
                "::",
                stringify!(a)
            )
        );
    }
    test_field_a();
    fn test_field_r1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hpf1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).r1) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hpf1),
                "::",
                stringify!(r1)
            )
        );
    }
    test_field_r1();
}
impl ::std::fmt::Debug for ma_hpf1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "ma_hpf1 {{ format: {:?}, channels: {:?}, a: {:?}, r1: [{}] }}",
            self.format,
            self.channels,
            self.a,
            self.r1
                .iter()
                .enumerate()
                .map(|(i, v)| format!("{}{:?}", if i > 0 { ", " } else { "" }, v))
                .collect::<String>()
        )
    }
}
extern "C" {
    pub fn ma_hpf1_init(pConfig: *const ma_hpf1_config, pHPF: *mut ma_hpf1) -> ma_result;
}
extern "C" {
    pub fn ma_hpf1_reinit(pConfig: *const ma_hpf1_config, pHPF: *mut ma_hpf1) -> ma_result;
}
extern "C" {
    pub fn ma_hpf1_process_pcm_frames(
        pHPF: *mut ma_hpf1,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf1_get_latency(pHPF: *const ma_hpf1) -> ma_uint32;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_hpf2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_hpf2() {
    assert_eq!(
        ::std::mem::size_of::<ma_hpf2>(),
        284usize,
        concat!("Size of: ", stringify!(ma_hpf2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_hpf2>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_hpf2))
    );
    fn test_field_bq() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hpf2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bq) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hpf2),
                "::",
                stringify!(bq)
            )
        );
    }
    test_field_bq();
}
impl ::std::fmt::Debug for ma_hpf2 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "ma_hpf2 {{ bq: {:?} }}", self.bq)
    }
}
extern "C" {
    pub fn ma_hpf2_init(pConfig: *const ma_hpf2_config, pHPF: *mut ma_hpf2) -> ma_result;
}
extern "C" {
    pub fn ma_hpf2_reinit(pConfig: *const ma_hpf2_config, pHPF: *mut ma_hpf2) -> ma_result;
}
extern "C" {
    pub fn ma_hpf2_process_pcm_frames(
        pHPF: *mut ma_hpf2,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf2_get_latency(pHPF: *const ma_hpf2) -> ma_uint32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_hpf_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub cutoffFrequency: f64,
    pub order: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_hpf_config() {
    assert_eq!(
        ::std::mem::size_of::<ma_hpf_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_hpf_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_hpf_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_hpf_config))
    );
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hpf_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hpf_config),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_channels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hpf_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hpf_config),
                "::",
                stringify!(channels)
            )
        );
    }
    test_field_channels();
    fn test_field_sampleRate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hpf_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hpf_config),
                "::",
                stringify!(sampleRate)
            )
        );
    }
    test_field_sampleRate();
    fn test_field_cutoffFrequency() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hpf_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cutoffFrequency) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hpf_config),
                "::",
                stringify!(cutoffFrequency)
            )
        );
    }
    test_field_cutoffFrequency();
    fn test_field_order() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hpf_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).order) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hpf_config),
                "::",
                stringify!(order)
            )
        );
    }
    test_field_order();
}
extern "C" {
    pub fn ma_hpf_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
        order: ma_uint32,
    ) -> ma_hpf_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_hpf {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub hpf1Count: ma_uint32,
    pub hpf2Count: ma_uint32,
    pub hpf1: [ma_hpf1; 1usize],
    pub hpf2: [ma_hpf2; 4usize],
}
#[test]
fn bindgen_test_layout_ma_hpf() {
    assert_eq!(
        ::std::mem::size_of::<ma_hpf>(),
        1296usize,
        concat!("Size of: ", stringify!(ma_hpf))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_hpf>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_hpf))
    );
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hpf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hpf),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_channels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hpf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hpf),
                "::",
                stringify!(channels)
            )
        );
    }
    test_field_channels();
    fn test_field_sampleRate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hpf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hpf),
                "::",
                stringify!(sampleRate)
            )
        );
    }
    test_field_sampleRate();
    fn test_field_hpf1Count() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hpf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hpf1Count) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hpf),
                "::",
                stringify!(hpf1Count)
            )
        );
    }
    test_field_hpf1Count();
    fn test_field_hpf2Count() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hpf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hpf2Count) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hpf),
                "::",
                stringify!(hpf2Count)
            )
        );
    }
    test_field_hpf2Count();
    fn test_field_hpf1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hpf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hpf1) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hpf),
                "::",
                stringify!(hpf1)
            )
        );
    }
    test_field_hpf1();
    fn test_field_hpf2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hpf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hpf2) as usize - ptr as usize
            },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hpf),
                "::",
                stringify!(hpf2)
            )
        );
    }
    test_field_hpf2();
}
impl ::std::fmt::Debug for ma_hpf {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "ma_hpf {{ format: {:?}, channels: {:?}, sampleRate: {:?}, hpf1Count: {:?}, hpf2Count: {:?}, hpf1: {:?}, hpf2: {:?} }}" , self . format , self . channels , self . sampleRate , self . hpf1Count , self . hpf2Count , self . hpf1 , self . hpf2)
    }
}
extern "C" {
    pub fn ma_hpf_init(pConfig: *const ma_hpf_config, pHPF: *mut ma_hpf) -> ma_result;
}
extern "C" {
    pub fn ma_hpf_reinit(pConfig: *const ma_hpf_config, pHPF: *mut ma_hpf) -> ma_result;
}
extern "C" {
    pub fn ma_hpf_process_pcm_frames(
        pHPF: *mut ma_hpf,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hpf_get_latency(pHPF: *const ma_hpf) -> ma_uint32;
}
#[doc = "Band-Pass Filtering"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_bpf2_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub cutoffFrequency: f64,
    pub q: f64,
}
#[test]
fn bindgen_test_layout_ma_bpf2_config() {
    assert_eq!(
        ::std::mem::size_of::<ma_bpf2_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_bpf2_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_bpf2_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_bpf2_config))
    );
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_bpf2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_bpf2_config),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_channels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_bpf2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_bpf2_config),
                "::",
                stringify!(channels)
            )
        );
    }
    test_field_channels();
    fn test_field_sampleRate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_bpf2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_bpf2_config),
                "::",
                stringify!(sampleRate)
            )
        );
    }
    test_field_sampleRate();
    fn test_field_cutoffFrequency() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_bpf2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cutoffFrequency) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_bpf2_config),
                "::",
                stringify!(cutoffFrequency)
            )
        );
    }
    test_field_cutoffFrequency();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_bpf2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_bpf2_config),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
}
extern "C" {
    pub fn ma_bpf2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
        q: f64,
    ) -> ma_bpf2_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_bpf2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_bpf2() {
    assert_eq!(
        ::std::mem::size_of::<ma_bpf2>(),
        284usize,
        concat!("Size of: ", stringify!(ma_bpf2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_bpf2>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_bpf2))
    );
    fn test_field_bq() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_bpf2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bq) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_bpf2),
                "::",
                stringify!(bq)
            )
        );
    }
    test_field_bq();
}
impl ::std::fmt::Debug for ma_bpf2 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "ma_bpf2 {{ bq: {:?} }}", self.bq)
    }
}
extern "C" {
    pub fn ma_bpf2_init(pConfig: *const ma_bpf2_config, pBPF: *mut ma_bpf2) -> ma_result;
}
extern "C" {
    pub fn ma_bpf2_reinit(pConfig: *const ma_bpf2_config, pBPF: *mut ma_bpf2) -> ma_result;
}
extern "C" {
    pub fn ma_bpf2_process_pcm_frames(
        pBPF: *mut ma_bpf2,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_bpf2_get_latency(pBPF: *const ma_bpf2) -> ma_uint32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_bpf_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub cutoffFrequency: f64,
    pub order: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_bpf_config() {
    assert_eq!(
        ::std::mem::size_of::<ma_bpf_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_bpf_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_bpf_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_bpf_config))
    );
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_bpf_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_bpf_config),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_channels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_bpf_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_bpf_config),
                "::",
                stringify!(channels)
            )
        );
    }
    test_field_channels();
    fn test_field_sampleRate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_bpf_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_bpf_config),
                "::",
                stringify!(sampleRate)
            )
        );
    }
    test_field_sampleRate();
    fn test_field_cutoffFrequency() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_bpf_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cutoffFrequency) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_bpf_config),
                "::",
                stringify!(cutoffFrequency)
            )
        );
    }
    test_field_cutoffFrequency();
    fn test_field_order() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_bpf_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).order) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_bpf_config),
                "::",
                stringify!(order)
            )
        );
    }
    test_field_order();
}
extern "C" {
    pub fn ma_bpf_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        cutoffFrequency: f64,
        order: ma_uint32,
    ) -> ma_bpf_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_bpf {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub bpf2Count: ma_uint32,
    pub bpf2: [ma_bpf2; 4usize],
}
#[test]
fn bindgen_test_layout_ma_bpf() {
    assert_eq!(
        ::std::mem::size_of::<ma_bpf>(),
        1148usize,
        concat!("Size of: ", stringify!(ma_bpf))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_bpf>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_bpf))
    );
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_bpf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_bpf),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_channels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_bpf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_bpf),
                "::",
                stringify!(channels)
            )
        );
    }
    test_field_channels();
    fn test_field_bpf2Count() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_bpf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bpf2Count) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_bpf),
                "::",
                stringify!(bpf2Count)
            )
        );
    }
    test_field_bpf2Count();
    fn test_field_bpf2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_bpf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bpf2) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_bpf),
                "::",
                stringify!(bpf2)
            )
        );
    }
    test_field_bpf2();
}
impl ::std::fmt::Debug for ma_bpf {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "ma_bpf {{ format: {:?}, channels: {:?}, bpf2Count: {:?}, bpf2: {:?} }}",
            self.format, self.channels, self.bpf2Count, self.bpf2
        )
    }
}
extern "C" {
    pub fn ma_bpf_init(pConfig: *const ma_bpf_config, pBPF: *mut ma_bpf) -> ma_result;
}
extern "C" {
    pub fn ma_bpf_reinit(pConfig: *const ma_bpf_config, pBPF: *mut ma_bpf) -> ma_result;
}
extern "C" {
    pub fn ma_bpf_process_pcm_frames(
        pBPF: *mut ma_bpf,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_bpf_get_latency(pBPF: *const ma_bpf) -> ma_uint32;
}
#[doc = "Notching Filter"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_notch2_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub q: f64,
    pub frequency: f64,
}
#[test]
fn bindgen_test_layout_ma_notch2_config() {
    assert_eq!(
        ::std::mem::size_of::<ma_notch2_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_notch2_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_notch2_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_notch2_config))
    );
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_notch2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_notch2_config),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_channels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_notch2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_notch2_config),
                "::",
                stringify!(channels)
            )
        );
    }
    test_field_channels();
    fn test_field_sampleRate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_notch2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_notch2_config),
                "::",
                stringify!(sampleRate)
            )
        );
    }
    test_field_sampleRate();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_notch2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_notch2_config),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
    fn test_field_frequency() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_notch2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).frequency) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_notch2_config),
                "::",
                stringify!(frequency)
            )
        );
    }
    test_field_frequency();
}
extern "C" {
    pub fn ma_notch2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        q: f64,
        frequency: f64,
    ) -> ma_notch2_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_notch2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_notch2() {
    assert_eq!(
        ::std::mem::size_of::<ma_notch2>(),
        284usize,
        concat!("Size of: ", stringify!(ma_notch2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_notch2>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_notch2))
    );
    fn test_field_bq() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_notch2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bq) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_notch2),
                "::",
                stringify!(bq)
            )
        );
    }
    test_field_bq();
}
impl ::std::fmt::Debug for ma_notch2 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "ma_notch2 {{ bq: {:?} }}", self.bq)
    }
}
extern "C" {
    pub fn ma_notch2_init(pConfig: *const ma_notch2_config, pFilter: *mut ma_notch2) -> ma_result;
}
extern "C" {
    pub fn ma_notch2_reinit(pConfig: *const ma_notch2_config, pFilter: *mut ma_notch2)
        -> ma_result;
}
extern "C" {
    pub fn ma_notch2_process_pcm_frames(
        pFilter: *mut ma_notch2,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_notch2_get_latency(pFilter: *const ma_notch2) -> ma_uint32;
}
#[doc = "Peaking EQ Filter"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_peak2_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub gainDB: f64,
    pub q: f64,
    pub frequency: f64,
}
#[test]
fn bindgen_test_layout_ma_peak2_config() {
    assert_eq!(
        ::std::mem::size_of::<ma_peak2_config>(),
        40usize,
        concat!("Size of: ", stringify!(ma_peak2_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_peak2_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_peak2_config))
    );
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_peak2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_peak2_config),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_channels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_peak2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_peak2_config),
                "::",
                stringify!(channels)
            )
        );
    }
    test_field_channels();
    fn test_field_sampleRate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_peak2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_peak2_config),
                "::",
                stringify!(sampleRate)
            )
        );
    }
    test_field_sampleRate();
    fn test_field_gainDB() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_peak2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gainDB) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_peak2_config),
                "::",
                stringify!(gainDB)
            )
        );
    }
    test_field_gainDB();
    fn test_field_q() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_peak2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_peak2_config),
                "::",
                stringify!(q)
            )
        );
    }
    test_field_q();
    fn test_field_frequency() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_peak2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).frequency) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_peak2_config),
                "::",
                stringify!(frequency)
            )
        );
    }
    test_field_frequency();
}
extern "C" {
    pub fn ma_peak2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        gainDB: f64,
        q: f64,
        frequency: f64,
    ) -> ma_peak2_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_peak2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_peak2() {
    assert_eq!(
        ::std::mem::size_of::<ma_peak2>(),
        284usize,
        concat!("Size of: ", stringify!(ma_peak2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_peak2>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_peak2))
    );
    fn test_field_bq() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_peak2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bq) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_peak2),
                "::",
                stringify!(bq)
            )
        );
    }
    test_field_bq();
}
impl ::std::fmt::Debug for ma_peak2 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "ma_peak2 {{ bq: {:?} }}", self.bq)
    }
}
extern "C" {
    pub fn ma_peak2_init(pConfig: *const ma_peak2_config, pFilter: *mut ma_peak2) -> ma_result;
}
extern "C" {
    pub fn ma_peak2_reinit(pConfig: *const ma_peak2_config, pFilter: *mut ma_peak2) -> ma_result;
}
extern "C" {
    pub fn ma_peak2_process_pcm_frames(
        pFilter: *mut ma_peak2,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_peak2_get_latency(pFilter: *const ma_peak2) -> ma_uint32;
}
#[doc = "Low Shelf Filter"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_loshelf2_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub gainDB: f64,
    pub shelfSlope: f64,
    pub frequency: f64,
}
#[test]
fn bindgen_test_layout_ma_loshelf2_config() {
    assert_eq!(
        ::std::mem::size_of::<ma_loshelf2_config>(),
        40usize,
        concat!("Size of: ", stringify!(ma_loshelf2_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_loshelf2_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_loshelf2_config))
    );
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_loshelf2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_loshelf2_config),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_channels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_loshelf2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_loshelf2_config),
                "::",
                stringify!(channels)
            )
        );
    }
    test_field_channels();
    fn test_field_sampleRate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_loshelf2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_loshelf2_config),
                "::",
                stringify!(sampleRate)
            )
        );
    }
    test_field_sampleRate();
    fn test_field_gainDB() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_loshelf2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gainDB) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_loshelf2_config),
                "::",
                stringify!(gainDB)
            )
        );
    }
    test_field_gainDB();
    fn test_field_shelfSlope() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_loshelf2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shelfSlope) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_loshelf2_config),
                "::",
                stringify!(shelfSlope)
            )
        );
    }
    test_field_shelfSlope();
    fn test_field_frequency() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_loshelf2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).frequency) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_loshelf2_config),
                "::",
                stringify!(frequency)
            )
        );
    }
    test_field_frequency();
}
extern "C" {
    pub fn ma_loshelf2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        gainDB: f64,
        shelfSlope: f64,
        frequency: f64,
    ) -> ma_loshelf2_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_loshelf2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_loshelf2() {
    assert_eq!(
        ::std::mem::size_of::<ma_loshelf2>(),
        284usize,
        concat!("Size of: ", stringify!(ma_loshelf2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_loshelf2>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_loshelf2))
    );
    fn test_field_bq() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_loshelf2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bq) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_loshelf2),
                "::",
                stringify!(bq)
            )
        );
    }
    test_field_bq();
}
impl ::std::fmt::Debug for ma_loshelf2 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "ma_loshelf2 {{ bq: {:?} }}", self.bq)
    }
}
extern "C" {
    pub fn ma_loshelf2_init(
        pConfig: *const ma_loshelf2_config,
        pFilter: *mut ma_loshelf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_loshelf2_reinit(
        pConfig: *const ma_loshelf2_config,
        pFilter: *mut ma_loshelf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_loshelf2_process_pcm_frames(
        pFilter: *mut ma_loshelf2,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_loshelf2_get_latency(pFilter: *const ma_loshelf2) -> ma_uint32;
}
#[doc = "High Shelf Filter"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_hishelf2_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub gainDB: f64,
    pub shelfSlope: f64,
    pub frequency: f64,
}
#[test]
fn bindgen_test_layout_ma_hishelf2_config() {
    assert_eq!(
        ::std::mem::size_of::<ma_hishelf2_config>(),
        40usize,
        concat!("Size of: ", stringify!(ma_hishelf2_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_hishelf2_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_hishelf2_config))
    );
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hishelf2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hishelf2_config),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_channels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hishelf2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hishelf2_config),
                "::",
                stringify!(channels)
            )
        );
    }
    test_field_channels();
    fn test_field_sampleRate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hishelf2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hishelf2_config),
                "::",
                stringify!(sampleRate)
            )
        );
    }
    test_field_sampleRate();
    fn test_field_gainDB() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hishelf2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gainDB) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hishelf2_config),
                "::",
                stringify!(gainDB)
            )
        );
    }
    test_field_gainDB();
    fn test_field_shelfSlope() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hishelf2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shelfSlope) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hishelf2_config),
                "::",
                stringify!(shelfSlope)
            )
        );
    }
    test_field_shelfSlope();
    fn test_field_frequency() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hishelf2_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).frequency) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hishelf2_config),
                "::",
                stringify!(frequency)
            )
        );
    }
    test_field_frequency();
}
extern "C" {
    pub fn ma_hishelf2_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRate: ma_uint32,
        gainDB: f64,
        shelfSlope: f64,
        frequency: f64,
    ) -> ma_hishelf2_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_hishelf2 {
    pub bq: ma_biquad,
}
#[test]
fn bindgen_test_layout_ma_hishelf2() {
    assert_eq!(
        ::std::mem::size_of::<ma_hishelf2>(),
        284usize,
        concat!("Size of: ", stringify!(ma_hishelf2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_hishelf2>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_hishelf2))
    );
    fn test_field_bq() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_hishelf2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bq) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_hishelf2),
                "::",
                stringify!(bq)
            )
        );
    }
    test_field_bq();
}
impl ::std::fmt::Debug for ma_hishelf2 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "ma_hishelf2 {{ bq: {:?} }}", self.bq)
    }
}
extern "C" {
    pub fn ma_hishelf2_init(
        pConfig: *const ma_hishelf2_config,
        pFilter: *mut ma_hishelf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hishelf2_reinit(
        pConfig: *const ma_hishelf2_config,
        pFilter: *mut ma_hishelf2,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hishelf2_process_pcm_frames(
        pFilter: *mut ma_hishelf2,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_hishelf2_get_latency(pFilter: *const ma_hishelf2) -> ma_uint32;
}
#[doc = "Resampling"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_linear_resampler_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRateIn: ma_uint32,
    pub sampleRateOut: ma_uint32,
    pub lpfOrder: ma_uint32,
    pub lpfNyquistFactor: f64,
}
#[test]
fn bindgen_test_layout_ma_linear_resampler_config() {
    assert_eq!(
        ::std::mem::size_of::<ma_linear_resampler_config>(),
        32usize,
        concat!("Size of: ", stringify!(ma_linear_resampler_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_linear_resampler_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_linear_resampler_config))
    );
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_linear_resampler_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_linear_resampler_config),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_channels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_linear_resampler_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_linear_resampler_config),
                "::",
                stringify!(channels)
            )
        );
    }
    test_field_channels();
    fn test_field_sampleRateIn() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_linear_resampler_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampleRateIn) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_linear_resampler_config),
                "::",
                stringify!(sampleRateIn)
            )
        );
    }
    test_field_sampleRateIn();
    fn test_field_sampleRateOut() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_linear_resampler_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampleRateOut) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_linear_resampler_config),
                "::",
                stringify!(sampleRateOut)
            )
        );
    }
    test_field_sampleRateOut();
    fn test_field_lpfOrder() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_linear_resampler_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).lpfOrder) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_linear_resampler_config),
                "::",
                stringify!(lpfOrder)
            )
        );
    }
    test_field_lpfOrder();
    fn test_field_lpfNyquistFactor() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_linear_resampler_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).lpfNyquistFactor) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_linear_resampler_config),
                "::",
                stringify!(lpfNyquistFactor)
            )
        );
    }
    test_field_lpfNyquistFactor();
}
extern "C" {
    pub fn ma_linear_resampler_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRateIn: ma_uint32,
        sampleRateOut: ma_uint32,
    ) -> ma_linear_resampler_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_linear_resampler {
    pub config: ma_linear_resampler_config,
    pub inAdvanceInt: ma_uint32,
    pub inAdvanceFrac: ma_uint32,
    pub inTimeInt: ma_uint32,
    pub inTimeFrac: ma_uint32,
    pub x0: ma_linear_resampler__bindgen_ty_1,
    pub x1: ma_linear_resampler__bindgen_ty_2,
    pub lpf: ma_lpf,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_linear_resampler__bindgen_ty_1 {
    pub f32_: [f32; 32usize],
    pub s16: [ma_int16; 32usize],
}
#[test]
fn bindgen_test_layout_ma_linear_resampler__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<ma_linear_resampler__bindgen_ty_1>(),
        128usize,
        concat!("Size of: ", stringify!(ma_linear_resampler__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_linear_resampler__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(ma_linear_resampler__bindgen_ty_1)
        )
    );
    fn test_field_f32() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_linear_resampler__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).f32_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_linear_resampler__bindgen_ty_1),
                "::",
                stringify!(f32_)
            )
        );
    }
    test_field_f32();
    fn test_field_s16() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_linear_resampler__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).s16) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_linear_resampler__bindgen_ty_1),
                "::",
                stringify!(s16)
            )
        );
    }
    test_field_s16();
}
impl ::std::fmt::Debug for ma_linear_resampler__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "ma_linear_resampler__bindgen_ty_1 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_linear_resampler__bindgen_ty_2 {
    pub f32_: [f32; 32usize],
    pub s16: [ma_int16; 32usize],
}
#[test]
fn bindgen_test_layout_ma_linear_resampler__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<ma_linear_resampler__bindgen_ty_2>(),
        128usize,
        concat!("Size of: ", stringify!(ma_linear_resampler__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_linear_resampler__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(ma_linear_resampler__bindgen_ty_2)
        )
    );
    fn test_field_f32() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_linear_resampler__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).f32_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_linear_resampler__bindgen_ty_2),
                "::",
                stringify!(f32_)
            )
        );
    }
    test_field_f32();
    fn test_field_s16() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_linear_resampler__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).s16) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_linear_resampler__bindgen_ty_2),
                "::",
                stringify!(s16)
            )
        );
    }
    test_field_s16();
}
impl ::std::fmt::Debug for ma_linear_resampler__bindgen_ty_2 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "ma_linear_resampler__bindgen_ty_2 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_ma_linear_resampler() {
    assert_eq!(
        ::std::mem::size_of::<ma_linear_resampler>(),
        1600usize,
        concat!("Size of: ", stringify!(ma_linear_resampler))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_linear_resampler>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_linear_resampler))
    );
    fn test_field_config() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_linear_resampler>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).config) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_linear_resampler),
                "::",
                stringify!(config)
            )
        );
    }
    test_field_config();
    fn test_field_inAdvanceInt() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_linear_resampler>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).inAdvanceInt) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_linear_resampler),
                "::",
                stringify!(inAdvanceInt)
            )
        );
    }
    test_field_inAdvanceInt();
    fn test_field_inAdvanceFrac() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_linear_resampler>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).inAdvanceFrac) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_linear_resampler),
                "::",
                stringify!(inAdvanceFrac)
            )
        );
    }
    test_field_inAdvanceFrac();
    fn test_field_inTimeInt() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_linear_resampler>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).inTimeInt) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_linear_resampler),
                "::",
                stringify!(inTimeInt)
            )
        );
    }
    test_field_inTimeInt();
    fn test_field_inTimeFrac() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_linear_resampler>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).inTimeFrac) as usize - ptr as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_linear_resampler),
                "::",
                stringify!(inTimeFrac)
            )
        );
    }
    test_field_inTimeFrac();
    fn test_field_x0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_linear_resampler>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x0) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_linear_resampler),
                "::",
                stringify!(x0)
            )
        );
    }
    test_field_x0();
    fn test_field_x1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_linear_resampler>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x1) as usize - ptr as usize
            },
            176usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_linear_resampler),
                "::",
                stringify!(x1)
            )
        );
    }
    test_field_x1();
    fn test_field_lpf() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_linear_resampler>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).lpf) as usize - ptr as usize
            },
            304usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_linear_resampler),
                "::",
                stringify!(lpf)
            )
        );
    }
    test_field_lpf();
}
impl ::std::fmt::Debug for ma_linear_resampler {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "ma_linear_resampler {{ config: {:?}, inAdvanceInt: {:?}, inAdvanceFrac: {:?}, inTimeInt: {:?}, inTimeFrac: {:?}, x0: {:?}, x1: {:?}, lpf: {:?} }}" , self . config , self . inAdvanceInt , self . inAdvanceFrac , self . inTimeInt , self . inTimeFrac , self . x0 , self . x1 , self . lpf)
    }
}
extern "C" {
    pub fn ma_linear_resampler_init(
        pConfig: *const ma_linear_resampler_config,
        pResampler: *mut ma_linear_resampler,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_linear_resampler_uninit(pResampler: *mut ma_linear_resampler);
}
extern "C" {
    pub fn ma_linear_resampler_process_pcm_frames(
        pResampler: *mut ma_linear_resampler,
        pFramesIn: *const ::std::os::raw::c_void,
        pFrameCountIn: *mut ma_uint64,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFrameCountOut: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_linear_resampler_set_rate(
        pResampler: *mut ma_linear_resampler,
        sampleRateIn: ma_uint32,
        sampleRateOut: ma_uint32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_linear_resampler_set_rate_ratio(
        pResampler: *mut ma_linear_resampler,
        ratioInOut: f32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_linear_resampler_get_required_input_frame_count(
        pResampler: *const ma_linear_resampler,
        outputFrameCount: ma_uint64,
    ) -> ma_uint64;
}
extern "C" {
    pub fn ma_linear_resampler_get_expected_output_frame_count(
        pResampler: *const ma_linear_resampler,
        inputFrameCount: ma_uint64,
    ) -> ma_uint64;
}
extern "C" {
    pub fn ma_linear_resampler_get_input_latency(
        pResampler: *const ma_linear_resampler,
    ) -> ma_uint64;
}
extern "C" {
    pub fn ma_linear_resampler_get_output_latency(
        pResampler: *const ma_linear_resampler,
    ) -> ma_uint64;
}
pub const ma_resample_algorithm_linear: ma_resample_algorithm = 0;
pub const ma_resample_algorithm_speex: ma_resample_algorithm = 1;
pub type ma_resample_algorithm = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_resampler_config {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRateIn: ma_uint32,
    pub sampleRateOut: ma_uint32,
    pub algorithm: ma_resample_algorithm,
    pub linear: ma_resampler_config__bindgen_ty_1,
    pub speex: ma_resampler_config__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_resampler_config__bindgen_ty_1 {
    pub lpfOrder: ma_uint32,
    pub lpfNyquistFactor: f64,
}
#[test]
fn bindgen_test_layout_ma_resampler_config__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<ma_resampler_config__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(ma_resampler_config__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_resampler_config__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ma_resampler_config__bindgen_ty_1)
        )
    );
    fn test_field_lpfOrder() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_resampler_config__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).lpfOrder) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_resampler_config__bindgen_ty_1),
                "::",
                stringify!(lpfOrder)
            )
        );
    }
    test_field_lpfOrder();
    fn test_field_lpfNyquistFactor() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_resampler_config__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).lpfNyquistFactor) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_resampler_config__bindgen_ty_1),
                "::",
                stringify!(lpfNyquistFactor)
            )
        );
    }
    test_field_lpfNyquistFactor();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_resampler_config__bindgen_ty_2 {
    pub quality: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ma_resampler_config__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<ma_resampler_config__bindgen_ty_2>(),
        4usize,
        concat!("Size of: ", stringify!(ma_resampler_config__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_resampler_config__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(ma_resampler_config__bindgen_ty_2)
        )
    );
    fn test_field_quality() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_resampler_config__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).quality) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_resampler_config__bindgen_ty_2),
                "::",
                stringify!(quality)
            )
        );
    }
    test_field_quality();
}
#[test]
fn bindgen_test_layout_ma_resampler_config() {
    assert_eq!(
        ::std::mem::size_of::<ma_resampler_config>(),
        48usize,
        concat!("Size of: ", stringify!(ma_resampler_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_resampler_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_resampler_config))
    );
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_resampler_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_resampler_config),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_channels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_resampler_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_resampler_config),
                "::",
                stringify!(channels)
            )
        );
    }
    test_field_channels();
    fn test_field_sampleRateIn() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_resampler_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampleRateIn) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_resampler_config),
                "::",
                stringify!(sampleRateIn)
            )
        );
    }
    test_field_sampleRateIn();
    fn test_field_sampleRateOut() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_resampler_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampleRateOut) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_resampler_config),
                "::",
                stringify!(sampleRateOut)
            )
        );
    }
    test_field_sampleRateOut();
    fn test_field_algorithm() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_resampler_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).algorithm) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_resampler_config),
                "::",
                stringify!(algorithm)
            )
        );
    }
    test_field_algorithm();
    fn test_field_linear() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_resampler_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).linear) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_resampler_config),
                "::",
                stringify!(linear)
            )
        );
    }
    test_field_linear();
    fn test_field_speex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_resampler_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).speex) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_resampler_config),
                "::",
                stringify!(speex)
            )
        );
    }
    test_field_speex();
}
extern "C" {
    pub fn ma_resampler_config_init(
        format: ma_format,
        channels: ma_uint32,
        sampleRateIn: ma_uint32,
        sampleRateOut: ma_uint32,
        algorithm: ma_resample_algorithm,
    ) -> ma_resampler_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_resampler {
    pub config: ma_resampler_config,
    pub state: ma_resampler__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_resampler__bindgen_ty_1 {
    pub linear: ma_linear_resampler,
    pub speex: ma_resampler__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_resampler__bindgen_ty_1__bindgen_ty_1 {
    pub pSpeexResamplerState: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ma_resampler__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<ma_resampler__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(ma_resampler__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<ma_resampler__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ma_resampler__bindgen_ty_1__bindgen_ty_1)
        )
    );
    fn test_field_pSpeexResamplerState() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<ma_resampler__bindgen_ty_1__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pSpeexResamplerState) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_resampler__bindgen_ty_1__bindgen_ty_1),
                "::",
                stringify!(pSpeexResamplerState)
            )
        );
    }
    test_field_pSpeexResamplerState();
}
#[test]
fn bindgen_test_layout_ma_resampler__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<ma_resampler__bindgen_ty_1>(),
        1600usize,
        concat!("Size of: ", stringify!(ma_resampler__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_resampler__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_resampler__bindgen_ty_1))
    );
    fn test_field_linear() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_resampler__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).linear) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_resampler__bindgen_ty_1),
                "::",
                stringify!(linear)
            )
        );
    }
    test_field_linear();
    fn test_field_speex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_resampler__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).speex) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_resampler__bindgen_ty_1),
                "::",
                stringify!(speex)
            )
        );
    }
    test_field_speex();
}
impl ::std::fmt::Debug for ma_resampler__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "ma_resampler__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_ma_resampler() {
    assert_eq!(
        ::std::mem::size_of::<ma_resampler>(),
        1648usize,
        concat!("Size of: ", stringify!(ma_resampler))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_resampler>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_resampler))
    );
    fn test_field_config() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_resampler>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).config) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_resampler),
                "::",
                stringify!(config)
            )
        );
    }
    test_field_config();
    fn test_field_state() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_resampler>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_resampler),
                "::",
                stringify!(state)
            )
        );
    }
    test_field_state();
}
impl ::std::fmt::Debug for ma_resampler {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "ma_resampler {{ config: {:?}, state: {:?} }}",
            self.config, self.state
        )
    }
}
extern "C" {
    pub fn ma_resampler_init(
        pConfig: *const ma_resampler_config,
        pResampler: *mut ma_resampler,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_resampler_uninit(pResampler: *mut ma_resampler);
}
extern "C" {
    pub fn ma_resampler_process_pcm_frames(
        pResampler: *mut ma_resampler,
        pFramesIn: *const ::std::os::raw::c_void,
        pFrameCountIn: *mut ma_uint64,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFrameCountOut: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_resampler_set_rate(
        pResampler: *mut ma_resampler,
        sampleRateIn: ma_uint32,
        sampleRateOut: ma_uint32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_resampler_set_rate_ratio(pResampler: *mut ma_resampler, ratio: f32) -> ma_result;
}
extern "C" {
    pub fn ma_resampler_get_required_input_frame_count(
        pResampler: *const ma_resampler,
        outputFrameCount: ma_uint64,
    ) -> ma_uint64;
}
extern "C" {
    pub fn ma_resampler_get_expected_output_frame_count(
        pResampler: *const ma_resampler,
        inputFrameCount: ma_uint64,
    ) -> ma_uint64;
}
extern "C" {
    pub fn ma_resampler_get_input_latency(pResampler: *const ma_resampler) -> ma_uint64;
}
extern "C" {
    pub fn ma_resampler_get_output_latency(pResampler: *const ma_resampler) -> ma_uint64;
}
#[doc = "Channel Conversion"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_channel_converter_config {
    pub format: ma_format,
    pub channelsIn: ma_uint32,
    pub channelsOut: ma_uint32,
    pub channelMapIn: [ma_channel; 32usize],
    pub channelMapOut: [ma_channel; 32usize],
    pub mixingMode: ma_channel_mix_mode,
    pub weights: [[f32; 32usize]; 32usize],
}
#[test]
fn bindgen_test_layout_ma_channel_converter_config() {
    assert_eq!(
        ::std::mem::size_of::<ma_channel_converter_config>(),
        4176usize,
        concat!("Size of: ", stringify!(ma_channel_converter_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_channel_converter_config>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_channel_converter_config))
    );
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_channel_converter_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_channel_converter_config),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_channelsIn() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_channel_converter_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channelsIn) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_channel_converter_config),
                "::",
                stringify!(channelsIn)
            )
        );
    }
    test_field_channelsIn();
    fn test_field_channelsOut() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_channel_converter_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channelsOut) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_channel_converter_config),
                "::",
                stringify!(channelsOut)
            )
        );
    }
    test_field_channelsOut();
    fn test_field_channelMapIn() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_channel_converter_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channelMapIn) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_channel_converter_config),
                "::",
                stringify!(channelMapIn)
            )
        );
    }
    test_field_channelMapIn();
    fn test_field_channelMapOut() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_channel_converter_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channelMapOut) as usize - ptr as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_channel_converter_config),
                "::",
                stringify!(channelMapOut)
            )
        );
    }
    test_field_channelMapOut();
    fn test_field_mixingMode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_channel_converter_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mixingMode) as usize - ptr as usize
            },
            76usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_channel_converter_config),
                "::",
                stringify!(mixingMode)
            )
        );
    }
    test_field_mixingMode();
    fn test_field_weights() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_channel_converter_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).weights) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_channel_converter_config),
                "::",
                stringify!(weights)
            )
        );
    }
    test_field_weights();
}
extern "C" {
    pub fn ma_channel_converter_config_init(
        format: ma_format,
        channelsIn: ma_uint32,
        pChannelMapIn: *const ma_channel,
        channelsOut: ma_uint32,
        pChannelMapOut: *const ma_channel,
        mixingMode: ma_channel_mix_mode,
    ) -> ma_channel_converter_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_channel_converter {
    pub format: ma_format,
    pub channelsIn: ma_uint32,
    pub channelsOut: ma_uint32,
    pub channelMapIn: [ma_channel; 32usize],
    pub channelMapOut: [ma_channel; 32usize],
    pub mixingMode: ma_channel_mix_mode,
    pub weights: ma_channel_converter__bindgen_ty_1,
    pub isPassthrough: ma_bool8,
    pub isSimpleShuffle: ma_bool8,
    pub isSimpleMonoExpansion: ma_bool8,
    pub isStereoToMono: ma_bool8,
    pub shuffleTable: [ma_uint8; 32usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_channel_converter__bindgen_ty_1 {
    pub f32_: [[f32; 32usize]; 32usize],
    pub s16: [[ma_int32; 32usize]; 32usize],
}
#[test]
fn bindgen_test_layout_ma_channel_converter__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<ma_channel_converter__bindgen_ty_1>(),
        4096usize,
        concat!("Size of: ", stringify!(ma_channel_converter__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_channel_converter__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(ma_channel_converter__bindgen_ty_1)
        )
    );
    fn test_field_f32() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<ma_channel_converter__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).f32_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_channel_converter__bindgen_ty_1),
                "::",
                stringify!(f32_)
            )
        );
    }
    test_field_f32();
    fn test_field_s16() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<ma_channel_converter__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).s16) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_channel_converter__bindgen_ty_1),
                "::",
                stringify!(s16)
            )
        );
    }
    test_field_s16();
}
impl ::std::fmt::Debug for ma_channel_converter__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "ma_channel_converter__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_ma_channel_converter() {
    assert_eq!(
        ::std::mem::size_of::<ma_channel_converter>(),
        4212usize,
        concat!("Size of: ", stringify!(ma_channel_converter))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_channel_converter>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_channel_converter))
    );
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_channel_converter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_channel_converter),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_channelsIn() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_channel_converter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channelsIn) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_channel_converter),
                "::",
                stringify!(channelsIn)
            )
        );
    }
    test_field_channelsIn();
    fn test_field_channelsOut() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_channel_converter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channelsOut) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_channel_converter),
                "::",
                stringify!(channelsOut)
            )
        );
    }
    test_field_channelsOut();
    fn test_field_channelMapIn() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_channel_converter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channelMapIn) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_channel_converter),
                "::",
                stringify!(channelMapIn)
            )
        );
    }
    test_field_channelMapIn();
    fn test_field_channelMapOut() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_channel_converter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channelMapOut) as usize - ptr as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_channel_converter),
                "::",
                stringify!(channelMapOut)
            )
        );
    }
    test_field_channelMapOut();
    fn test_field_mixingMode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_channel_converter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mixingMode) as usize - ptr as usize
            },
            76usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_channel_converter),
                "::",
                stringify!(mixingMode)
            )
        );
    }
    test_field_mixingMode();
    fn test_field_weights() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_channel_converter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).weights) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_channel_converter),
                "::",
                stringify!(weights)
            )
        );
    }
    test_field_weights();
    fn test_field_isPassthrough() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_channel_converter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).isPassthrough) as usize - ptr as usize
            },
            4176usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_channel_converter),
                "::",
                stringify!(isPassthrough)
            )
        );
    }
    test_field_isPassthrough();
    fn test_field_isSimpleShuffle() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_channel_converter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).isSimpleShuffle) as usize - ptr as usize
            },
            4177usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_channel_converter),
                "::",
                stringify!(isSimpleShuffle)
            )
        );
    }
    test_field_isSimpleShuffle();
    fn test_field_isSimpleMonoExpansion() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_channel_converter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).isSimpleMonoExpansion) as usize - ptr as usize
            },
            4178usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_channel_converter),
                "::",
                stringify!(isSimpleMonoExpansion)
            )
        );
    }
    test_field_isSimpleMonoExpansion();
    fn test_field_isStereoToMono() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_channel_converter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).isStereoToMono) as usize - ptr as usize
            },
            4179usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_channel_converter),
                "::",
                stringify!(isStereoToMono)
            )
        );
    }
    test_field_isStereoToMono();
    fn test_field_shuffleTable() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_channel_converter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shuffleTable) as usize - ptr as usize
            },
            4180usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_channel_converter),
                "::",
                stringify!(shuffleTable)
            )
        );
    }
    test_field_shuffleTable();
}
impl ::std::fmt::Debug for ma_channel_converter {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "ma_channel_converter {{ format: {:?}, channelsIn: {:?}, channelsOut: {:?}, channelMapIn: [{}], channelMapOut: [{}], mixingMode: {:?}, weights: {:?}, isPassthrough: {:?}, isSimpleShuffle: {:?}, isSimpleMonoExpansion: {:?}, isStereoToMono: {:?}, shuffleTable: [{}] }}" , self . format , self . channelsIn , self . channelsOut , self . channelMapIn . iter () . enumerate () . map (| (i , v) | format ! ("{}{:?}" , if i > 0 { ", " } else { "" } , v)) . collect :: < String > () , self . channelMapOut . iter () . enumerate () . map (| (i , v) | format ! ("{}{:?}" , if i > 0 { ", " } else { "" } , v)) . collect :: < String > () , self . mixingMode , self . weights , self . isPassthrough , self . isSimpleShuffle , self . isSimpleMonoExpansion , self . isStereoToMono , self . shuffleTable . iter () . enumerate () . map (| (i , v) | format ! ("{}{:?}" , if i > 0 { ", " } else { "" } , v)) . collect :: < String > ())
    }
}
extern "C" {
    pub fn ma_channel_converter_init(
        pConfig: *const ma_channel_converter_config,
        pConverter: *mut ma_channel_converter,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_channel_converter_uninit(pConverter: *mut ma_channel_converter);
}
extern "C" {
    pub fn ma_channel_converter_process_pcm_frames(
        pConverter: *mut ma_channel_converter,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFramesIn: *const ::std::os::raw::c_void,
        frameCount: ma_uint64,
    ) -> ma_result;
}
#[doc = "Data Conversion"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_data_converter_config {
    pub formatIn: ma_format,
    pub formatOut: ma_format,
    pub channelsIn: ma_uint32,
    pub channelsOut: ma_uint32,
    pub sampleRateIn: ma_uint32,
    pub sampleRateOut: ma_uint32,
    pub channelMapIn: [ma_channel; 32usize],
    pub channelMapOut: [ma_channel; 32usize],
    pub ditherMode: ma_dither_mode,
    pub channelMixMode: ma_channel_mix_mode,
    pub channelWeights: [[f32; 32usize]; 32usize],
    pub resampling: ma_data_converter_config__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_data_converter_config__bindgen_ty_1 {
    pub algorithm: ma_resample_algorithm,
    pub allowDynamicSampleRate: ma_bool32,
    pub linear: ma_data_converter_config__bindgen_ty_1__bindgen_ty_1,
    pub speex: ma_data_converter_config__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_data_converter_config__bindgen_ty_1__bindgen_ty_1 {
    pub lpfOrder: ma_uint32,
    pub lpfNyquistFactor: f64,
}
#[test]
fn bindgen_test_layout_ma_data_converter_config__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<ma_data_converter_config__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(ma_data_converter_config__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<ma_data_converter_config__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ma_data_converter_config__bindgen_ty_1__bindgen_ty_1)
        )
    );
    fn test_field_lpfOrder() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    ma_data_converter_config__bindgen_ty_1__bindgen_ty_1,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).lpfOrder) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter_config__bindgen_ty_1__bindgen_ty_1),
                "::",
                stringify!(lpfOrder)
            )
        );
    }
    test_field_lpfOrder();
    fn test_field_lpfNyquistFactor() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    ma_data_converter_config__bindgen_ty_1__bindgen_ty_1,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).lpfNyquistFactor) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter_config__bindgen_ty_1__bindgen_ty_1),
                "::",
                stringify!(lpfNyquistFactor)
            )
        );
    }
    test_field_lpfNyquistFactor();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_data_converter_config__bindgen_ty_1__bindgen_ty_2 {
    pub quality: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ma_data_converter_config__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<ma_data_converter_config__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(ma_data_converter_config__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<ma_data_converter_config__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(ma_data_converter_config__bindgen_ty_1__bindgen_ty_2)
        )
    );
    fn test_field_quality() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    ma_data_converter_config__bindgen_ty_1__bindgen_ty_2,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).quality) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter_config__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(quality)
            )
        );
    }
    test_field_quality();
}
#[test]
fn bindgen_test_layout_ma_data_converter_config__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<ma_data_converter_config__bindgen_ty_1>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(ma_data_converter_config__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<ma_data_converter_config__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ma_data_converter_config__bindgen_ty_1)
        )
    );
    fn test_field_algorithm() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<ma_data_converter_config__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).algorithm) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter_config__bindgen_ty_1),
                "::",
                stringify!(algorithm)
            )
        );
    }
    test_field_algorithm();
    fn test_field_allowDynamicSampleRate() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<ma_data_converter_config__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).allowDynamicSampleRate) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter_config__bindgen_ty_1),
                "::",
                stringify!(allowDynamicSampleRate)
            )
        );
    }
    test_field_allowDynamicSampleRate();
    fn test_field_linear() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<ma_data_converter_config__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).linear) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter_config__bindgen_ty_1),
                "::",
                stringify!(linear)
            )
        );
    }
    test_field_linear();
    fn test_field_speex() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<ma_data_converter_config__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).speex) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter_config__bindgen_ty_1),
                "::",
                stringify!(speex)
            )
        );
    }
    test_field_speex();
}
#[test]
fn bindgen_test_layout_ma_data_converter_config() {
    assert_eq!(
        ::std::mem::size_of::<ma_data_converter_config>(),
        4224usize,
        concat!("Size of: ", stringify!(ma_data_converter_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_data_converter_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_data_converter_config))
    );
    fn test_field_formatIn() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_data_converter_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).formatIn) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter_config),
                "::",
                stringify!(formatIn)
            )
        );
    }
    test_field_formatIn();
    fn test_field_formatOut() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_data_converter_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).formatOut) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter_config),
                "::",
                stringify!(formatOut)
            )
        );
    }
    test_field_formatOut();
    fn test_field_channelsIn() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_data_converter_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channelsIn) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter_config),
                "::",
                stringify!(channelsIn)
            )
        );
    }
    test_field_channelsIn();
    fn test_field_channelsOut() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_data_converter_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channelsOut) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter_config),
                "::",
                stringify!(channelsOut)
            )
        );
    }
    test_field_channelsOut();
    fn test_field_sampleRateIn() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_data_converter_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampleRateIn) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter_config),
                "::",
                stringify!(sampleRateIn)
            )
        );
    }
    test_field_sampleRateIn();
    fn test_field_sampleRateOut() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_data_converter_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampleRateOut) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter_config),
                "::",
                stringify!(sampleRateOut)
            )
        );
    }
    test_field_sampleRateOut();
    fn test_field_channelMapIn() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_data_converter_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channelMapIn) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter_config),
                "::",
                stringify!(channelMapIn)
            )
        );
    }
    test_field_channelMapIn();
    fn test_field_channelMapOut() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_data_converter_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channelMapOut) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter_config),
                "::",
                stringify!(channelMapOut)
            )
        );
    }
    test_field_channelMapOut();
    fn test_field_ditherMode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_data_converter_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ditherMode) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter_config),
                "::",
                stringify!(ditherMode)
            )
        );
    }
    test_field_ditherMode();
    fn test_field_channelMixMode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_data_converter_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channelMixMode) as usize - ptr as usize
            },
            92usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter_config),
                "::",
                stringify!(channelMixMode)
            )
        );
    }
    test_field_channelMixMode();
    fn test_field_channelWeights() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_data_converter_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channelWeights) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter_config),
                "::",
                stringify!(channelWeights)
            )
        );
    }
    test_field_channelWeights();
    fn test_field_resampling() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_data_converter_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).resampling) as usize - ptr as usize
            },
            4192usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter_config),
                "::",
                stringify!(resampling)
            )
        );
    }
    test_field_resampling();
}
extern "C" {
    pub fn ma_data_converter_config_init_default() -> ma_data_converter_config;
}
extern "C" {
    pub fn ma_data_converter_config_init(
        formatIn: ma_format,
        formatOut: ma_format,
        channelsIn: ma_uint32,
        channelsOut: ma_uint32,
        sampleRateIn: ma_uint32,
        sampleRateOut: ma_uint32,
    ) -> ma_data_converter_config;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_data_converter {
    pub config: ma_data_converter_config,
    pub channelConverter: ma_channel_converter,
    pub resampler: ma_resampler,
    pub hasPreFormatConversion: ma_bool8,
    pub hasPostFormatConversion: ma_bool8,
    pub hasChannelConverter: ma_bool8,
    pub hasResampler: ma_bool8,
    pub isPassthrough: ma_bool8,
}
#[test]
fn bindgen_test_layout_ma_data_converter() {
    assert_eq!(
        ::std::mem::size_of::<ma_data_converter>(),
        10096usize,
        concat!("Size of: ", stringify!(ma_data_converter))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_data_converter>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_data_converter))
    );
    fn test_field_config() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_data_converter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).config) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter),
                "::",
                stringify!(config)
            )
        );
    }
    test_field_config();
    fn test_field_channelConverter() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_data_converter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channelConverter) as usize - ptr as usize
            },
            4224usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter),
                "::",
                stringify!(channelConverter)
            )
        );
    }
    test_field_channelConverter();
    fn test_field_resampler() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_data_converter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).resampler) as usize - ptr as usize
            },
            8440usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter),
                "::",
                stringify!(resampler)
            )
        );
    }
    test_field_resampler();
    fn test_field_hasPreFormatConversion() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_data_converter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hasPreFormatConversion) as usize - ptr as usize
            },
            10088usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter),
                "::",
                stringify!(hasPreFormatConversion)
            )
        );
    }
    test_field_hasPreFormatConversion();
    fn test_field_hasPostFormatConversion() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_data_converter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hasPostFormatConversion) as usize - ptr as usize
            },
            10089usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter),
                "::",
                stringify!(hasPostFormatConversion)
            )
        );
    }
    test_field_hasPostFormatConversion();
    fn test_field_hasChannelConverter() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_data_converter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hasChannelConverter) as usize - ptr as usize
            },
            10090usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter),
                "::",
                stringify!(hasChannelConverter)
            )
        );
    }
    test_field_hasChannelConverter();
    fn test_field_hasResampler() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_data_converter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hasResampler) as usize - ptr as usize
            },
            10091usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter),
                "::",
                stringify!(hasResampler)
            )
        );
    }
    test_field_hasResampler();
    fn test_field_isPassthrough() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_data_converter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).isPassthrough) as usize - ptr as usize
            },
            10092usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_data_converter),
                "::",
                stringify!(isPassthrough)
            )
        );
    }
    test_field_isPassthrough();
}
impl ::std::fmt::Debug for ma_data_converter {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "ma_data_converter {{ config: {:?}, channelConverter: {:?}, resampler: {:?}, hasPreFormatConversion: {:?}, hasPostFormatConversion: {:?}, hasChannelConverter: {:?}, hasResampler: {:?}, isPassthrough: {:?} }}" , self . config , self . channelConverter , self . resampler , self . hasPreFormatConversion , self . hasPostFormatConversion , self . hasChannelConverter , self . hasResampler , self . isPassthrough)
    }
}
extern "C" {
    pub fn ma_data_converter_init(
        pConfig: *const ma_data_converter_config,
        pConverter: *mut ma_data_converter,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_uninit(pConverter: *mut ma_data_converter);
}
extern "C" {
    pub fn ma_data_converter_process_pcm_frames(
        pConverter: *mut ma_data_converter,
        pFramesIn: *const ::std::os::raw::c_void,
        pFrameCountIn: *mut ma_uint64,
        pFramesOut: *mut ::std::os::raw::c_void,
        pFrameCountOut: *mut ma_uint64,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_set_rate(
        pConverter: *mut ma_data_converter,
        sampleRateIn: ma_uint32,
        sampleRateOut: ma_uint32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_set_rate_ratio(
        pConverter: *mut ma_data_converter,
        ratioInOut: f32,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_data_converter_get_required_input_frame_count(
        pConverter: *const ma_data_converter,
        outputFrameCount: ma_uint64,
    ) -> ma_uint64;
}
extern "C" {
    pub fn ma_data_converter_get_expected_output_frame_count(
        pConverter: *const ma_data_converter,
        inputFrameCount: ma_uint64,
    ) -> ma_uint64;
}
extern "C" {
    pub fn ma_data_converter_get_input_latency(pConverter: *const ma_data_converter) -> ma_uint64;
}
extern "C" {
    pub fn ma_data_converter_get_output_latency(pConverter: *const ma_data_converter) -> ma_uint64;
}
extern "C" {
    #[doc = "Format Conversion"]
    pub fn ma_pcm_u8_to_s16(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_u8_to_s24(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_u8_to_s32(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_u8_to_f32(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s16_to_u8(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s16_to_s24(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s16_to_s32(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s16_to_f32(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s24_to_u8(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s24_to_s16(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s24_to_s32(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s24_to_f32(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s32_to_u8(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s32_to_s16(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s32_to_s24(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_s32_to_f32(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_f32_to_u8(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_f32_to_s16(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_f32_to_s24(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_f32_to_s32(
        pOut: *mut ::std::os::raw::c_void,
        pIn: *const ::std::os::raw::c_void,
        count: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_pcm_convert(
        pOut: *mut ::std::os::raw::c_void,
        formatOut: ma_format,
        pIn: *const ::std::os::raw::c_void,
        formatIn: ma_format,
        sampleCount: ma_uint64,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_convert_pcm_frames_format(
        pOut: *mut ::std::os::raw::c_void,
        formatOut: ma_format,
        pIn: *const ::std::os::raw::c_void,
        formatIn: ma_format,
        frameCount: ma_uint64,
        channels: ma_uint32,
        ditherMode: ma_dither_mode,
    );
}
extern "C" {
    pub fn ma_deinterleave_pcm_frames(
        format: ma_format,
        channels: ma_uint32,
        frameCount: ma_uint64,
        pInterleavedPCMFrames: *const ::std::os::raw::c_void,
        ppDeinterleavedPCMFrames: *mut *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn ma_interleave_pcm_frames(
        format: ma_format,
        channels: ma_uint32,
        frameCount: ma_uint64,
        ppDeinterleavedPCMFrames: *mut *const ::std::os::raw::c_void,
        pInterleavedPCMFrames: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    #[doc = "Channel Maps"]
    pub fn ma_channel_map_init_blank(channels: ma_uint32, pChannelMap: *mut ma_channel);
}
extern "C" {
    pub fn ma_get_standard_channel_map(
        standardChannelMap: ma_standard_channel_map,
        channels: ma_uint32,
        pChannelMap: *mut ma_channel,
    );
}
extern "C" {
    pub fn ma_channel_map_copy(pOut: *mut ma_channel, pIn: *const ma_channel, channels: ma_uint32);
}
extern "C" {
    pub fn ma_channel_map_copy_or_default(
        pOut: *mut ma_channel,
        pIn: *const ma_channel,
        channels: ma_uint32,
    );
}
extern "C" {
    pub fn ma_channel_map_valid(channels: ma_uint32, pChannelMap: *const ma_channel) -> ma_bool32;
}
extern "C" {
    pub fn ma_channel_map_equal(
        channels: ma_uint32,
        pChannelMapA: *const ma_channel,
        pChannelMapB: *const ma_channel,
    ) -> ma_bool32;
}
extern "C" {
    pub fn ma_channel_map_blank(channels: ma_uint32, pChannelMap: *const ma_channel) -> ma_bool32;
}
extern "C" {
    pub fn ma_channel_map_contains_channel_position(
        channels: ma_uint32,
        pChannelMap: *const ma_channel,
        channelPosition: ma_channel,
    ) -> ma_bool32;
}
extern "C" {
    #[doc = "Conversion Helpers"]
    pub fn ma_convert_frames(
        pOut: *mut ::std::os::raw::c_void,
        frameCountOut: ma_uint64,
        formatOut: ma_format,
        channelsOut: ma_uint32,
        sampleRateOut: ma_uint32,
        pIn: *const ::std::os::raw::c_void,
        frameCountIn: ma_uint64,
        formatIn: ma_format,
        channelsIn: ma_uint32,
        sampleRateIn: ma_uint32,
    ) -> ma_uint64;
}
extern "C" {
    pub fn ma_convert_frames_ex(
        pOut: *mut ::std::os::raw::c_void,
        frameCountOut: ma_uint64,
        pIn: *const ::std::os::raw::c_void,
        frameCountIn: ma_uint64,
        pConfig: *const ma_data_converter_config,
    ) -> ma_uint64;
}
#[doc = "Ring Buffer"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_rb {
    pub pBuffer: *mut ::std::os::raw::c_void,
    pub subbufferSizeInBytes: ma_uint32,
    pub subbufferCount: ma_uint32,
    pub subbufferStrideInBytes: ma_uint32,
    pub encodedReadOffset: ma_uint32,
    pub encodedWriteOffset: ma_uint32,
    pub ownsBuffer: ma_bool8,
    pub clearOnWriteAcquire: ma_bool8,
    pub allocationCallbacks: ma_allocation_callbacks,
}
#[test]
fn bindgen_test_layout_ma_rb() {
    assert_eq!(
        ::std::mem::size_of::<ma_rb>(),
        64usize,
        concat!("Size of: ", stringify!(ma_rb))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_rb>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_rb))
    );
    fn test_field_pBuffer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_rb>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pBuffer) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_rb),
                "::",
                stringify!(pBuffer)
            )
        );
    }
    test_field_pBuffer();
    fn test_field_subbufferSizeInBytes() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_rb>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).subbufferSizeInBytes) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_rb),
                "::",
                stringify!(subbufferSizeInBytes)
            )
        );
    }
    test_field_subbufferSizeInBytes();
    fn test_field_subbufferCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_rb>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).subbufferCount) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_rb),
                "::",
                stringify!(subbufferCount)
            )
        );
    }
    test_field_subbufferCount();
    fn test_field_subbufferStrideInBytes() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_rb>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).subbufferStrideInBytes) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_rb),
                "::",
                stringify!(subbufferStrideInBytes)
            )
        );
    }
    test_field_subbufferStrideInBytes();
    fn test_field_encodedReadOffset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_rb>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).encodedReadOffset) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_rb),
                "::",
                stringify!(encodedReadOffset)
            )
        );
    }
    test_field_encodedReadOffset();
    fn test_field_encodedWriteOffset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_rb>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).encodedWriteOffset) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_rb),
                "::",
                stringify!(encodedWriteOffset)
            )
        );
    }
    test_field_encodedWriteOffset();
    fn test_field_ownsBuffer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_rb>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ownsBuffer) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_rb),
                "::",
                stringify!(ownsBuffer)
            )
        );
    }
    test_field_ownsBuffer();
    fn test_field_clearOnWriteAcquire() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_rb>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).clearOnWriteAcquire) as usize - ptr as usize
            },
            29usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_rb),
                "::",
                stringify!(clearOnWriteAcquire)
            )
        );
    }
    test_field_clearOnWriteAcquire();
    fn test_field_allocationCallbacks() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_rb>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).allocationCallbacks) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_rb),
                "::",
                stringify!(allocationCallbacks)
            )
        );
    }
    test_field_allocationCallbacks();
}
extern "C" {
    pub fn ma_rb_init_ex(
        subbufferSizeInBytes: usize,
        subbufferCount: usize,
        subbufferStrideInBytes: usize,
        pOptionalPreallocatedBuffer: *mut ::std::os::raw::c_void,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pRB: *mut ma_rb,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_rb_init(
        bufferSizeInBytes: usize,
        pOptionalPreallocatedBuffer: *mut ::std::os::raw::c_void,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pRB: *mut ma_rb,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_rb_uninit(pRB: *mut ma_rb);
}
extern "C" {
    pub fn ma_rb_reset(pRB: *mut ma_rb);
}
extern "C" {
    pub fn ma_rb_acquire_read(
        pRB: *mut ma_rb,
        pSizeInBytes: *mut usize,
        ppBufferOut: *mut *mut ::std::os::raw::c_void,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_rb_commit_read(
        pRB: *mut ma_rb,
        sizeInBytes: usize,
        pBufferOut: *mut ::std::os::raw::c_void,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_rb_acquire_write(
        pRB: *mut ma_rb,
        pSizeInBytes: *mut usize,
        ppBufferOut: *mut *mut ::std::os::raw::c_void,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_rb_commit_write(
        pRB: *mut ma_rb,
        sizeInBytes: usize,
        pBufferOut: *mut ::std::os::raw::c_void,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_rb_seek_read(pRB: *mut ma_rb, offsetInBytes: usize) -> ma_result;
}
extern "C" {
    pub fn ma_rb_seek_write(pRB: *mut ma_rb, offsetInBytes: usize) -> ma_result;
}
extern "C" {
    pub fn ma_rb_pointer_distance(pRB: *mut ma_rb) -> ma_int32;
}
extern "C" {
    pub fn ma_rb_available_read(pRB: *mut ma_rb) -> ma_uint32;
}
extern "C" {
    pub fn ma_rb_available_write(pRB: *mut ma_rb) -> ma_uint32;
}
extern "C" {
    pub fn ma_rb_get_subbuffer_size(pRB: *mut ma_rb) -> usize;
}
extern "C" {
    pub fn ma_rb_get_subbuffer_stride(pRB: *mut ma_rb) -> usize;
}
extern "C" {
    pub fn ma_rb_get_subbuffer_offset(pRB: *mut ma_rb, subbufferIndex: usize) -> usize;
}
extern "C" {
    pub fn ma_rb_get_subbuffer_ptr(
        pRB: *mut ma_rb,
        subbufferIndex: usize,
        pBuffer: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_pcm_rb {
    pub rb: ma_rb,
    pub format: ma_format,
    pub channels: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_pcm_rb() {
    assert_eq!(
        ::std::mem::size_of::<ma_pcm_rb>(),
        72usize,
        concat!("Size of: ", stringify!(ma_pcm_rb))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_pcm_rb>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_pcm_rb))
    );
    fn test_field_rb() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_pcm_rb>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rb) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_pcm_rb),
                "::",
                stringify!(rb)
            )
        );
    }
    test_field_rb();
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_pcm_rb>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_pcm_rb),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_channels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_pcm_rb>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize
            },
            68usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_pcm_rb),
                "::",
                stringify!(channels)
            )
        );
    }
    test_field_channels();
}
extern "C" {
    pub fn ma_pcm_rb_init_ex(
        format: ma_format,
        channels: ma_uint32,
        subbufferSizeInFrames: ma_uint32,
        subbufferCount: ma_uint32,
        subbufferStrideInFrames: ma_uint32,
        pOptionalPreallocatedBuffer: *mut ::std::os::raw::c_void,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pRB: *mut ma_pcm_rb,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_init(
        format: ma_format,
        channels: ma_uint32,
        bufferSizeInFrames: ma_uint32,
        pOptionalPreallocatedBuffer: *mut ::std::os::raw::c_void,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pRB: *mut ma_pcm_rb,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_uninit(pRB: *mut ma_pcm_rb);
}
extern "C" {
    pub fn ma_pcm_rb_reset(pRB: *mut ma_pcm_rb);
}
extern "C" {
    pub fn ma_pcm_rb_acquire_read(
        pRB: *mut ma_pcm_rb,
        pSizeInFrames: *mut ma_uint32,
        ppBufferOut: *mut *mut ::std::os::raw::c_void,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_commit_read(
        pRB: *mut ma_pcm_rb,
        sizeInFrames: ma_uint32,
        pBufferOut: *mut ::std::os::raw::c_void,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_acquire_write(
        pRB: *mut ma_pcm_rb,
        pSizeInFrames: *mut ma_uint32,
        ppBufferOut: *mut *mut ::std::os::raw::c_void,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_commit_write(
        pRB: *mut ma_pcm_rb,
        sizeInFrames: ma_uint32,
        pBufferOut: *mut ::std::os::raw::c_void,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_seek_read(pRB: *mut ma_pcm_rb, offsetInFrames: ma_uint32) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_seek_write(pRB: *mut ma_pcm_rb, offsetInFrames: ma_uint32) -> ma_result;
}
extern "C" {
    pub fn ma_pcm_rb_pointer_distance(pRB: *mut ma_pcm_rb) -> ma_int32;
}
extern "C" {
    pub fn ma_pcm_rb_available_read(pRB: *mut ma_pcm_rb) -> ma_uint32;
}
extern "C" {
    pub fn ma_pcm_rb_available_write(pRB: *mut ma_pcm_rb) -> ma_uint32;
}
extern "C" {
    pub fn ma_pcm_rb_get_subbuffer_size(pRB: *mut ma_pcm_rb) -> ma_uint32;
}
extern "C" {
    pub fn ma_pcm_rb_get_subbuffer_stride(pRB: *mut ma_pcm_rb) -> ma_uint32;
}
extern "C" {
    pub fn ma_pcm_rb_get_subbuffer_offset(
        pRB: *mut ma_pcm_rb,
        subbufferIndex: ma_uint32,
    ) -> ma_uint32;
}
extern "C" {
    pub fn ma_pcm_rb_get_subbuffer_ptr(
        pRB: *mut ma_pcm_rb,
        subbufferIndex: ma_uint32,
        pBuffer: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_duplex_rb {
    pub rb: ma_pcm_rb,
}
#[test]
fn bindgen_test_layout_ma_duplex_rb() {
    assert_eq!(
        ::std::mem::size_of::<ma_duplex_rb>(),
        72usize,
        concat!("Size of: ", stringify!(ma_duplex_rb))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_duplex_rb>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_duplex_rb))
    );
    fn test_field_rb() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_duplex_rb>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rb) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_duplex_rb),
                "::",
                stringify!(rb)
            )
        );
    }
    test_field_rb();
}
extern "C" {
    pub fn ma_duplex_rb_init(
        inputSampleRate: ma_uint32,
        captureFormat: ma_format,
        captureChannels: ma_uint32,
        captureSampleRate: ma_uint32,
        capturePeriodSizeInFrames: ma_uint32,
        pAllocationCallbacks: *const ma_allocation_callbacks,
        pRB: *mut ma_duplex_rb,
    ) -> ma_result;
}
extern "C" {
    pub fn ma_duplex_rb_uninit(pRB: *mut ma_duplex_rb) -> ma_result;
}
extern "C" {
    #[doc = "Miscellaneous Helpers"]
    pub fn ma_result_description(result: ma_result) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn ma_malloc(
        sz: usize,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ma_realloc(
        p: *mut ::std::os::raw::c_void,
        sz: usize,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ma_free(
        p: *mut ::std::os::raw::c_void,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_aligned_malloc(
        sz: usize,
        alignment: usize,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ma_aligned_free(
        p: *mut ::std::os::raw::c_void,
        pAllocationCallbacks: *const ma_allocation_callbacks,
    );
}
extern "C" {
    pub fn ma_get_format_name(format: ma_format) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn ma_blend_f32(
        pOut: *mut f32,
        pInA: *mut f32,
        pInB: *mut f32,
        factor: f32,
        channels: ma_uint32,
    );
}
extern "C" {
    pub fn ma_get_bytes_per_sample(format: ma_format) -> ma_uint32;
}
extern "C" {
    pub fn ma_log_level_to_string(logLevel: ma_uint32) -> *const ::std::os::raw::c_char;
}
pub const ma_backend_wasapi: ma_backend = 0;
pub const ma_backend_dsound: ma_backend = 1;
pub const ma_backend_winmm: ma_backend = 2;
pub const ma_backend_coreaudio: ma_backend = 3;
pub const ma_backend_sndio: ma_backend = 4;
pub const ma_backend_audio4: ma_backend = 5;
pub const ma_backend_oss: ma_backend = 6;
pub const ma_backend_pulseaudio: ma_backend = 7;
pub const ma_backend_alsa: ma_backend = 8;
pub const ma_backend_jack: ma_backend = 9;
pub const ma_backend_aaudio: ma_backend = 10;
pub const ma_backend_opensl: ma_backend = 11;
pub const ma_backend_webaudio: ma_backend = 12;
pub const ma_backend_custom: ma_backend = 13;
pub const ma_backend_null: ma_backend = 14;
pub type ma_backend = ::std::os::raw::c_uint;
pub type ma_device_callback_proc = ::std::option::Option<
    unsafe extern "C" fn(
        pDevice: *mut ma_device,
        pOutput: *mut ::std::os::raw::c_void,
        pInput: *const ::std::os::raw::c_void,
        frameCount: ma_uint32,
    ),
>;
pub type ma_stop_proc = ::std::option::Option<unsafe extern "C" fn(pDevice: *mut ma_device)>;
pub type ma_log_proc = ::std::option::Option<
    unsafe extern "C" fn(
        pContext: *mut ma_context,
        pDevice: *mut ma_device,
        logLevel: ma_uint32,
        message: *const ::std::os::raw::c_char,
    ),
>;
pub const ma_device_type_playback: ma_device_type = 1;
pub const ma_device_type_capture: ma_device_type = 2;
pub const ma_device_type_duplex: ma_device_type = 3;
pub const ma_device_type_loopback: ma_device_type = 4;
pub type ma_device_type = ::std::os::raw::c_uint;
pub const ma_share_mode_shared: ma_share_mode = 0;
pub const ma_share_mode_exclusive: ma_share_mode = 1;
pub type ma_share_mode = ::std::os::raw::c_uint;
pub const ma_ios_session_category_default: ma_ios_session_category = 0;
pub const ma_ios_session_category_none: ma_ios_session_category = 1;
pub const ma_ios_session_category_ambient: ma_ios_session_category = 2;
pub const ma_ios_session_category_solo_ambient: ma_ios_session_category = 3;
pub const ma_ios_session_category_playback: ma_ios_session_category = 4;
pub const ma_ios_session_category_record: ma_ios_session_category = 5;
pub const ma_ios_session_category_play_and_record: ma_ios_session_category = 6;
pub const ma_ios_session_category_multi_route: ma_ios_session_category = 7;
pub type ma_ios_session_category = ::std::os::raw::c_uint;
pub const ma_ios_session_category_option_mix_with_others: ma_ios_session_category_option = 1;
pub const ma_ios_session_category_option_duck_others: ma_ios_session_category_option = 2;
pub const ma_ios_session_category_option_allow_bluetooth: ma_ios_session_category_option = 4;
pub const ma_ios_session_category_option_default_to_speaker: ma_ios_session_category_option = 8;
pub const ma_ios_session_category_option_interrupt_spoken_audio_and_mix_with_others:
    ma_ios_session_category_option = 17;
pub const ma_ios_session_category_option_allow_bluetooth_a2dp: ma_ios_session_category_option = 32;
pub const ma_ios_session_category_option_allow_air_play: ma_ios_session_category_option = 64;
pub type ma_ios_session_category_option = ::std::os::raw::c_uint;
pub const ma_opensl_stream_type_default: ma_opensl_stream_type = 0;
pub const ma_opensl_stream_type_voice: ma_opensl_stream_type = 1;
pub const ma_opensl_stream_type_system: ma_opensl_stream_type = 2;
pub const ma_opensl_stream_type_ring: ma_opensl_stream_type = 3;
pub const ma_opensl_stream_type_media: ma_opensl_stream_type = 4;
pub const ma_opensl_stream_type_alarm: ma_opensl_stream_type = 5;
pub const ma_opensl_stream_type_notification: ma_opensl_stream_type = 6;
pub type ma_opensl_stream_type = ::std::os::raw::c_uint;
pub const ma_opensl_recording_preset_default: ma_opensl_recording_preset = 0;
pub const ma_opensl_recording_preset_generic: ma_opensl_recording_preset = 1;
pub const ma_opensl_recording_preset_camcorder: ma_opensl_recording_preset = 2;
pub const ma_opensl_recording_preset_voice_recognition: ma_opensl_recording_preset = 3;
pub const ma_opensl_recording_preset_voice_communication: ma_opensl_recording_preset = 4;
pub const ma_opensl_recording_preset_voice_unprocessed: ma_opensl_recording_preset = 5;
pub type ma_opensl_recording_preset = ::std::os::raw::c_uint;
pub const ma_aaudio_usage_default: ma_aaudio_usage = 0;
pub const ma_aaudio_usage_announcement: ma_aaudio_usage = 1;
pub const ma_aaudio_usage_emergency: ma_aaudio_usage = 2;
pub const ma_aaudio_usage_safety: ma_aaudio_usage = 3;
pub const ma_aaudio_usage_vehicle_status: ma_aaudio_usage = 4;
pub const ma_aaudio_usage_alarm: ma_aaudio_usage = 5;
pub const ma_aaudio_usage_assistance_accessibility: ma_aaudio_usage = 6;
pub const ma_aaudio_usage_assistance_navigation_guidance: ma_aaudio_usage = 7;
pub const ma_aaudio_usage_assistance_sonification: ma_aaudio_usage = 8;
pub const ma_aaudio_usage_assitant: ma_aaudio_usage = 9;
pub const ma_aaudio_usage_game: ma_aaudio_usage = 10;
pub const ma_aaudio_usage_media: ma_aaudio_usage = 11;
pub const ma_aaudio_usage_notification: ma_aaudio_usage = 12;
pub const ma_aaudio_usage_notification_event: ma_aaudio_usage = 13;
pub const ma_aaudio_usage_notification_ringtone: ma_aaudio_usage = 14;
pub const ma_aaudio_usage_voice_communication: ma_aaudio_usage = 15;
pub const ma_aaudio_usage_voice_communication_signalling: ma_aaudio_usage = 16;
pub type ma_aaudio_usage = ::std::os::raw::c_uint;
pub const ma_aaudio_content_type_default: ma_aaudio_content_type = 0;
pub const ma_aaudio_content_type_movie: ma_aaudio_content_type = 1;
pub const ma_aaudio_content_type_music: ma_aaudio_content_type = 2;
pub const ma_aaudio_content_type_sonification: ma_aaudio_content_type = 3;
pub const ma_aaudio_content_type_speech: ma_aaudio_content_type = 4;
pub type ma_aaudio_content_type = ::std::os::raw::c_uint;
pub const ma_aaudio_input_preset_default: ma_aaudio_input_preset = 0;
pub const ma_aaudio_input_preset_generic: ma_aaudio_input_preset = 1;
pub const ma_aaudio_input_preset_camcorder: ma_aaudio_input_preset = 2;
pub const ma_aaudio_input_preset_unprocessed: ma_aaudio_input_preset = 3;
pub const ma_aaudio_input_preset_voice_recognition: ma_aaudio_input_preset = 4;
pub const ma_aaudio_input_preset_voice_communication: ma_aaudio_input_preset = 5;
pub const ma_aaudio_input_preset_voice_performance: ma_aaudio_input_preset = 6;
pub type ma_aaudio_input_preset = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_timer {
    pub counter: ma_int64,
    pub counterD: f64,
}
#[test]
fn bindgen_test_layout_ma_timer() {
    assert_eq!(
        ::std::mem::size_of::<ma_timer>(),
        8usize,
        concat!("Size of: ", stringify!(ma_timer))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_timer>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_timer))
    );
    fn test_field_counter() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_timer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).counter) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_timer),
                "::",
                stringify!(counter)
            )
        );
    }
    test_field_counter();
    fn test_field_counterD() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_timer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).counterD) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_timer),
                "::",
                stringify!(counterD)
            )
        );
    }
    test_field_counterD();
}
impl ::std::fmt::Debug for ma_timer {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "ma_timer {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_device_id {
    pub wasapi: [wchar_t; 64usize],
    pub dsound: [ma_uint8; 16usize],
    pub winmm: ma_uint32,
    pub alsa: [::std::os::raw::c_char; 256usize],
    pub pulse: [::std::os::raw::c_char; 256usize],
    pub jack: ::std::os::raw::c_int,
    pub coreaudio: [::std::os::raw::c_char; 256usize],
    pub sndio: [::std::os::raw::c_char; 256usize],
    pub audio4: [::std::os::raw::c_char; 256usize],
    pub oss: [::std::os::raw::c_char; 64usize],
    pub aaudio: ma_int32,
    pub opensl: ma_uint32,
    pub webaudio: [::std::os::raw::c_char; 32usize],
    pub custom: ma_device_id__bindgen_ty_1,
    pub nullbackend: ::std::os::raw::c_int,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_device_id__bindgen_ty_1 {
    pub i: ::std::os::raw::c_int,
    pub s: [::std::os::raw::c_char; 256usize],
    pub p: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ma_device_id__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<ma_device_id__bindgen_ty_1>(),
        256usize,
        concat!("Size of: ", stringify!(ma_device_id__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_device_id__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_device_id__bindgen_ty_1))
    );
    fn test_field_i() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_id__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).i) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_id__bindgen_ty_1),
                "::",
                stringify!(i)
            )
        );
    }
    test_field_i();
    fn test_field_s() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_id__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).s) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_id__bindgen_ty_1),
                "::",
                stringify!(s)
            )
        );
    }
    test_field_s();
    fn test_field_p() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_id__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_id__bindgen_ty_1),
                "::",
                stringify!(p)
            )
        );
    }
    test_field_p();
}
impl ::std::fmt::Debug for ma_device_id__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "ma_device_id__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_ma_device_id() {
    assert_eq!(
        ::std::mem::size_of::<ma_device_id>(),
        256usize,
        concat!("Size of: ", stringify!(ma_device_id))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_device_id>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_device_id))
    );
    fn test_field_wasapi() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_id>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).wasapi) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_id),
                "::",
                stringify!(wasapi)
            )
        );
    }
    test_field_wasapi();
    fn test_field_dsound() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_id>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dsound) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_id),
                "::",
                stringify!(dsound)
            )
        );
    }
    test_field_dsound();
    fn test_field_winmm() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_id>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).winmm) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_id),
                "::",
                stringify!(winmm)
            )
        );
    }
    test_field_winmm();
    fn test_field_alsa() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_id>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).alsa) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_id),
                "::",
                stringify!(alsa)
            )
        );
    }
    test_field_alsa();
    fn test_field_pulse() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_id>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pulse) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_id),
                "::",
                stringify!(pulse)
            )
        );
    }
    test_field_pulse();
    fn test_field_jack() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_id>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).jack) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_id),
                "::",
                stringify!(jack)
            )
        );
    }
    test_field_jack();
    fn test_field_coreaudio() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_id>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).coreaudio) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_id),
                "::",
                stringify!(coreaudio)
            )
        );
    }
    test_field_coreaudio();
    fn test_field_sndio() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_id>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sndio) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_id),
                "::",
                stringify!(sndio)
            )
        );
    }
    test_field_sndio();
    fn test_field_audio4() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_id>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).audio4) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_id),
                "::",
                stringify!(audio4)
            )
        );
    }
    test_field_audio4();
    fn test_field_oss() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_id>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).oss) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_id),
                "::",
                stringify!(oss)
            )
        );
    }
    test_field_oss();
    fn test_field_aaudio() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_id>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).aaudio) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_id),
                "::",
                stringify!(aaudio)
            )
        );
    }
    test_field_aaudio();
    fn test_field_opensl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_id>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).opensl) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_id),
                "::",
                stringify!(opensl)
            )
        );
    }
    test_field_opensl();
    fn test_field_webaudio() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_id>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).webaudio) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_id),
                "::",
                stringify!(webaudio)
            )
        );
    }
    test_field_webaudio();
    fn test_field_custom() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_id>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).custom) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_id),
                "::",
                stringify!(custom)
            )
        );
    }
    test_field_custom();
    fn test_field_nullbackend() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_id>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nullbackend) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_id),
                "::",
                stringify!(nullbackend)
            )
        );
    }
    test_field_nullbackend();
}
impl ::std::fmt::Debug for ma_device_id {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "ma_device_id {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_device_info {
    pub id: ma_device_id,
    pub name: [::std::os::raw::c_char; 256usize],
    pub isDefault: ma_bool32,
    pub formatCount: ma_uint32,
    pub formats: [ma_format; 6usize],
    pub minChannels: ma_uint32,
    pub maxChannels: ma_uint32,
    pub minSampleRate: ma_uint32,
    pub maxSampleRate: ma_uint32,
    pub nativeDataFormatCount: ma_uint32,
    pub nativeDataFormats: [ma_device_info__bindgen_ty_1; 64usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_info__bindgen_ty_1 {
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub flags: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_device_info__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<ma_device_info__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(ma_device_info__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_device_info__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_device_info__bindgen_ty_1))
    );
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_info__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_info__bindgen_ty_1),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_channels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_info__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_info__bindgen_ty_1),
                "::",
                stringify!(channels)
            )
        );
    }
    test_field_channels();
    fn test_field_sampleRate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_info__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_info__bindgen_ty_1),
                "::",
                stringify!(sampleRate)
            )
        );
    }
    test_field_sampleRate();
    fn test_field_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_info__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_info__bindgen_ty_1),
                "::",
                stringify!(flags)
            )
        );
    }
    test_field_flags();
}
#[test]
fn bindgen_test_layout_ma_device_info() {
    assert_eq!(
        ::std::mem::size_of::<ma_device_info>(),
        1592usize,
        concat!("Size of: ", stringify!(ma_device_info))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_device_info>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_device_info))
    );
    fn test_field_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_info),
                "::",
                stringify!(id)
            )
        );
    }
    test_field_id();
    fn test_field_name() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize
            },
            256usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_info),
                "::",
                stringify!(name)
            )
        );
    }
    test_field_name();
    fn test_field_isDefault() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).isDefault) as usize - ptr as usize
            },
            512usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_info),
                "::",
                stringify!(isDefault)
            )
        );
    }
    test_field_isDefault();
    fn test_field_formatCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).formatCount) as usize - ptr as usize
            },
            516usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_info),
                "::",
                stringify!(formatCount)
            )
        );
    }
    test_field_formatCount();
    fn test_field_formats() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).formats) as usize - ptr as usize
            },
            520usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_info),
                "::",
                stringify!(formats)
            )
        );
    }
    test_field_formats();
    fn test_field_minChannels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).minChannels) as usize - ptr as usize
            },
            544usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_info),
                "::",
                stringify!(minChannels)
            )
        );
    }
    test_field_minChannels();
    fn test_field_maxChannels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxChannels) as usize - ptr as usize
            },
            548usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_info),
                "::",
                stringify!(maxChannels)
            )
        );
    }
    test_field_maxChannels();
    fn test_field_minSampleRate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).minSampleRate) as usize - ptr as usize
            },
            552usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_info),
                "::",
                stringify!(minSampleRate)
            )
        );
    }
    test_field_minSampleRate();
    fn test_field_maxSampleRate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxSampleRate) as usize - ptr as usize
            },
            556usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_info),
                "::",
                stringify!(maxSampleRate)
            )
        );
    }
    test_field_maxSampleRate();
    fn test_field_nativeDataFormatCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nativeDataFormatCount) as usize - ptr as usize
            },
            560usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_info),
                "::",
                stringify!(nativeDataFormatCount)
            )
        );
    }
    test_field_nativeDataFormatCount();
    fn test_field_nativeDataFormats() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_info>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nativeDataFormats) as usize - ptr as usize
            },
            564usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_info),
                "::",
                stringify!(nativeDataFormats)
            )
        );
    }
    test_field_nativeDataFormats();
}
impl ::std::fmt::Debug for ma_device_info {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "ma_device_info {{ id: {:?}, name: [{}], isDefault: {:?}, formatCount: {:?}, formats: {:?}, minChannels: {:?}, maxChannels: {:?}, minSampleRate: {:?}, maxSampleRate: {:?}, nativeDataFormatCount: {:?}, nativeDataFormats: [{}] }}" , self . id , self . name . iter () . enumerate () . map (| (i , v) | format ! ("{}{:?}" , if i > 0 { ", " } else { "" } , v)) . collect :: < String > () , self . isDefault , self . formatCount , self . formats , self . minChannels , self . maxChannels , self . minSampleRate , self . maxSampleRate , self . nativeDataFormatCount , self . nativeDataFormats . iter () . enumerate () . map (| (i , v) | format ! ("{}{:?}" , if i > 0 { ", " } else { "" } , v)) . collect :: < String > ())
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_config {
    pub deviceType: ma_device_type,
    pub sampleRate: ma_uint32,
    pub periodSizeInFrames: ma_uint32,
    pub periodSizeInMilliseconds: ma_uint32,
    pub periods: ma_uint32,
    pub performanceProfile: ma_performance_profile,
    pub noPreZeroedOutputBuffer: ma_bool8,
    pub noClip: ma_bool8,
    pub dataCallback: ma_device_callback_proc,
    pub stopCallback: ma_stop_proc,
    pub pUserData: *mut ::std::os::raw::c_void,
    pub resampling: ma_device_config__bindgen_ty_1,
    pub playback: ma_device_config__bindgen_ty_2,
    pub capture: ma_device_config__bindgen_ty_3,
    pub wasapi: ma_device_config__bindgen_ty_4,
    pub alsa: ma_device_config__bindgen_ty_5,
    pub pulse: ma_device_config__bindgen_ty_6,
    pub coreaudio: ma_device_config__bindgen_ty_7,
    pub opensl: ma_device_config__bindgen_ty_8,
    pub aaudio: ma_device_config__bindgen_ty_9,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_config__bindgen_ty_1 {
    pub algorithm: ma_resample_algorithm,
    pub linear: ma_device_config__bindgen_ty_1__bindgen_ty_1,
    pub speex: ma_device_config__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_config__bindgen_ty_1__bindgen_ty_1 {
    pub lpfOrder: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_device_config__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<ma_device_config__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(ma_device_config__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<ma_device_config__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(ma_device_config__bindgen_ty_1__bindgen_ty_1)
        )
    );
    fn test_field_lpfOrder() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_1__bindgen_ty_1>::uninit(
                    );
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).lpfOrder) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_1__bindgen_ty_1),
                "::",
                stringify!(lpfOrder)
            )
        );
    }
    test_field_lpfOrder();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_config__bindgen_ty_1__bindgen_ty_2 {
    pub quality: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ma_device_config__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<ma_device_config__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(ma_device_config__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<ma_device_config__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(ma_device_config__bindgen_ty_1__bindgen_ty_2)
        )
    );
    fn test_field_quality() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_1__bindgen_ty_2>::uninit(
                    );
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).quality) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_1__bindgen_ty_2),
                "::",
                stringify!(quality)
            )
        );
    }
    test_field_quality();
}
#[test]
fn bindgen_test_layout_ma_device_config__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<ma_device_config__bindgen_ty_1>(),
        12usize,
        concat!("Size of: ", stringify!(ma_device_config__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_device_config__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_device_config__bindgen_ty_1))
    );
    fn test_field_algorithm() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).algorithm) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_1),
                "::",
                stringify!(algorithm)
            )
        );
    }
    test_field_algorithm();
    fn test_field_linear() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).linear) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_1),
                "::",
                stringify!(linear)
            )
        );
    }
    test_field_linear();
    fn test_field_speex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).speex) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_1),
                "::",
                stringify!(speex)
            )
        );
    }
    test_field_speex();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_config__bindgen_ty_2 {
    pub pDeviceID: *const ma_device_id,
    pub format: ma_format,
    pub channels: ma_uint32,
    pub channelMap: [ma_channel; 32usize],
    pub channelMixMode: ma_channel_mix_mode,
    pub shareMode: ma_share_mode,
}
#[test]
fn bindgen_test_layout_ma_device_config__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<ma_device_config__bindgen_ty_2>(),
        56usize,
        concat!("Size of: ", stringify!(ma_device_config__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_device_config__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_device_config__bindgen_ty_2))
    );
    fn test_field_pDeviceID() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pDeviceID) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_2),
                "::",
                stringify!(pDeviceID)
            )
        );
    }
    test_field_pDeviceID();
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_2),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_channels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_2),
                "::",
                stringify!(channels)
            )
        );
    }
    test_field_channels();
    fn test_field_channelMap() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channelMap) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_2),
                "::",
                stringify!(channelMap)
            )
        );
    }
    test_field_channelMap();
    fn test_field_channelMixMode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channelMixMode) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_2),
                "::",
                stringify!(channelMixMode)
            )
        );
    }
    test_field_channelMixMode();
    fn test_field_shareMode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shareMode) as usize - ptr as usize
            },
            52usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_2),
                "::",
                stringify!(shareMode)
            )
        );
    }
    test_field_shareMode();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_config__bindgen_ty_3 {
    pub pDeviceID: *const ma_device_id,
    pub format: ma_format,
    pub channels: ma_uint32,
    pub channelMap: [ma_channel; 32usize],
    pub channelMixMode: ma_channel_mix_mode,
    pub shareMode: ma_share_mode,
}
#[test]
fn bindgen_test_layout_ma_device_config__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<ma_device_config__bindgen_ty_3>(),
        56usize,
        concat!("Size of: ", stringify!(ma_device_config__bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_device_config__bindgen_ty_3>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_device_config__bindgen_ty_3))
    );
    fn test_field_pDeviceID() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pDeviceID) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_3),
                "::",
                stringify!(pDeviceID)
            )
        );
    }
    test_field_pDeviceID();
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_3),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_channels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_3),
                "::",
                stringify!(channels)
            )
        );
    }
    test_field_channels();
    fn test_field_channelMap() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channelMap) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_3),
                "::",
                stringify!(channelMap)
            )
        );
    }
    test_field_channelMap();
    fn test_field_channelMixMode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channelMixMode) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_3),
                "::",
                stringify!(channelMixMode)
            )
        );
    }
    test_field_channelMixMode();
    fn test_field_shareMode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shareMode) as usize - ptr as usize
            },
            52usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_3),
                "::",
                stringify!(shareMode)
            )
        );
    }
    test_field_shareMode();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_config__bindgen_ty_4 {
    pub noAutoConvertSRC: ma_bool8,
    pub noDefaultQualitySRC: ma_bool8,
    pub noAutoStreamRouting: ma_bool8,
    pub noHardwareOffloading: ma_bool8,
}
#[test]
fn bindgen_test_layout_ma_device_config__bindgen_ty_4() {
    assert_eq!(
        ::std::mem::size_of::<ma_device_config__bindgen_ty_4>(),
        4usize,
        concat!("Size of: ", stringify!(ma_device_config__bindgen_ty_4))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_device_config__bindgen_ty_4>(),
        1usize,
        concat!("Alignment of ", stringify!(ma_device_config__bindgen_ty_4))
    );
    fn test_field_noAutoConvertSRC() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_4>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).noAutoConvertSRC) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_4),
                "::",
                stringify!(noAutoConvertSRC)
            )
        );
    }
    test_field_noAutoConvertSRC();
    fn test_field_noDefaultQualitySRC() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_4>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).noDefaultQualitySRC) as usize - ptr as usize
            },
            1usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_4),
                "::",
                stringify!(noDefaultQualitySRC)
            )
        );
    }
    test_field_noDefaultQualitySRC();
    fn test_field_noAutoStreamRouting() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_4>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).noAutoStreamRouting) as usize - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_4),
                "::",
                stringify!(noAutoStreamRouting)
            )
        );
    }
    test_field_noAutoStreamRouting();
    fn test_field_noHardwareOffloading() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_4>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).noHardwareOffloading) as usize - ptr as usize
            },
            3usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_4),
                "::",
                stringify!(noHardwareOffloading)
            )
        );
    }
    test_field_noHardwareOffloading();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_config__bindgen_ty_5 {
    pub noMMap: ma_bool32,
    pub noAutoFormat: ma_bool32,
    pub noAutoChannels: ma_bool32,
    pub noAutoResample: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_device_config__bindgen_ty_5() {
    assert_eq!(
        ::std::mem::size_of::<ma_device_config__bindgen_ty_5>(),
        16usize,
        concat!("Size of: ", stringify!(ma_device_config__bindgen_ty_5))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_device_config__bindgen_ty_5>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_device_config__bindgen_ty_5))
    );
    fn test_field_noMMap() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_5>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).noMMap) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_5),
                "::",
                stringify!(noMMap)
            )
        );
    }
    test_field_noMMap();
    fn test_field_noAutoFormat() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_5>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).noAutoFormat) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_5),
                "::",
                stringify!(noAutoFormat)
            )
        );
    }
    test_field_noAutoFormat();
    fn test_field_noAutoChannels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_5>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).noAutoChannels) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_5),
                "::",
                stringify!(noAutoChannels)
            )
        );
    }
    test_field_noAutoChannels();
    fn test_field_noAutoResample() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_5>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).noAutoResample) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_5),
                "::",
                stringify!(noAutoResample)
            )
        );
    }
    test_field_noAutoResample();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_config__bindgen_ty_6 {
    pub pStreamNamePlayback: *const ::std::os::raw::c_char,
    pub pStreamNameCapture: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_ma_device_config__bindgen_ty_6() {
    assert_eq!(
        ::std::mem::size_of::<ma_device_config__bindgen_ty_6>(),
        16usize,
        concat!("Size of: ", stringify!(ma_device_config__bindgen_ty_6))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_device_config__bindgen_ty_6>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_device_config__bindgen_ty_6))
    );
    fn test_field_pStreamNamePlayback() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_6>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pStreamNamePlayback) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_6),
                "::",
                stringify!(pStreamNamePlayback)
            )
        );
    }
    test_field_pStreamNamePlayback();
    fn test_field_pStreamNameCapture() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_6>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pStreamNameCapture) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_6),
                "::",
                stringify!(pStreamNameCapture)
            )
        );
    }
    test_field_pStreamNameCapture();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_config__bindgen_ty_7 {
    pub allowNominalSampleRateChange: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_device_config__bindgen_ty_7() {
    assert_eq!(
        ::std::mem::size_of::<ma_device_config__bindgen_ty_7>(),
        4usize,
        concat!("Size of: ", stringify!(ma_device_config__bindgen_ty_7))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_device_config__bindgen_ty_7>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_device_config__bindgen_ty_7))
    );
    fn test_field_allowNominalSampleRateChange() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_7>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).allowNominalSampleRateChange) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_7),
                "::",
                stringify!(allowNominalSampleRateChange)
            )
        );
    }
    test_field_allowNominalSampleRateChange();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_config__bindgen_ty_8 {
    pub streamType: ma_opensl_stream_type,
    pub recordingPreset: ma_opensl_recording_preset,
}
#[test]
fn bindgen_test_layout_ma_device_config__bindgen_ty_8() {
    assert_eq!(
        ::std::mem::size_of::<ma_device_config__bindgen_ty_8>(),
        8usize,
        concat!("Size of: ", stringify!(ma_device_config__bindgen_ty_8))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_device_config__bindgen_ty_8>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_device_config__bindgen_ty_8))
    );
    fn test_field_streamType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_8>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).streamType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_8),
                "::",
                stringify!(streamType)
            )
        );
    }
    test_field_streamType();
    fn test_field_recordingPreset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_8>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).recordingPreset) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_8),
                "::",
                stringify!(recordingPreset)
            )
        );
    }
    test_field_recordingPreset();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_config__bindgen_ty_9 {
    pub usage: ma_aaudio_usage,
    pub contentType: ma_aaudio_content_type,
    pub inputPreset: ma_aaudio_input_preset,
}
#[test]
fn bindgen_test_layout_ma_device_config__bindgen_ty_9() {
    assert_eq!(
        ::std::mem::size_of::<ma_device_config__bindgen_ty_9>(),
        12usize,
        concat!("Size of: ", stringify!(ma_device_config__bindgen_ty_9))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_device_config__bindgen_ty_9>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_device_config__bindgen_ty_9))
    );
    fn test_field_usage() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_9>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).usage) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_9),
                "::",
                stringify!(usage)
            )
        );
    }
    test_field_usage();
    fn test_field_contentType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_9>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).contentType) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_9),
                "::",
                stringify!(contentType)
            )
        );
    }
    test_field_contentType();
    fn test_field_inputPreset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config__bindgen_ty_9>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).inputPreset) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config__bindgen_ty_9),
                "::",
                stringify!(inputPreset)
            )
        );
    }
    test_field_inputPreset();
}
#[test]
fn bindgen_test_layout_ma_device_config() {
    assert_eq!(
        ::std::mem::size_of::<ma_device_config>(),
        248usize,
        concat!("Size of: ", stringify!(ma_device_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_device_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_device_config))
    );
    fn test_field_deviceType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).deviceType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config),
                "::",
                stringify!(deviceType)
            )
        );
    }
    test_field_deviceType();
    fn test_field_sampleRate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config),
                "::",
                stringify!(sampleRate)
            )
        );
    }
    test_field_sampleRate();
    fn test_field_periodSizeInFrames() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).periodSizeInFrames) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config),
                "::",
                stringify!(periodSizeInFrames)
            )
        );
    }
    test_field_periodSizeInFrames();
    fn test_field_periodSizeInMilliseconds() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).periodSizeInMilliseconds) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config),
                "::",
                stringify!(periodSizeInMilliseconds)
            )
        );
    }
    test_field_periodSizeInMilliseconds();
    fn test_field_periods() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).periods) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config),
                "::",
                stringify!(periods)
            )
        );
    }
    test_field_periods();
    fn test_field_performanceProfile() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).performanceProfile) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config),
                "::",
                stringify!(performanceProfile)
            )
        );
    }
    test_field_performanceProfile();
    fn test_field_noPreZeroedOutputBuffer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).noPreZeroedOutputBuffer) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config),
                "::",
                stringify!(noPreZeroedOutputBuffer)
            )
        );
    }
    test_field_noPreZeroedOutputBuffer();
    fn test_field_noClip() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).noClip) as usize - ptr as usize
            },
            25usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config),
                "::",
                stringify!(noClip)
            )
        );
    }
    test_field_noClip();
    fn test_field_dataCallback() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dataCallback) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config),
                "::",
                stringify!(dataCallback)
            )
        );
    }
    test_field_dataCallback();
    fn test_field_stopCallback() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).stopCallback) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config),
                "::",
                stringify!(stopCallback)
            )
        );
    }
    test_field_stopCallback();
    fn test_field_pUserData() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pUserData) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config),
                "::",
                stringify!(pUserData)
            )
        );
    }
    test_field_pUserData();
    fn test_field_resampling() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).resampling) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config),
                "::",
                stringify!(resampling)
            )
        );
    }
    test_field_resampling();
    fn test_field_playback() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).playback) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config),
                "::",
                stringify!(playback)
            )
        );
    }
    test_field_playback();
    fn test_field_capture() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).capture) as usize - ptr as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config),
                "::",
                stringify!(capture)
            )
        );
    }
    test_field_capture();
    fn test_field_wasapi() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).wasapi) as usize - ptr as usize
            },
            184usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config),
                "::",
                stringify!(wasapi)
            )
        );
    }
    test_field_wasapi();
    fn test_field_alsa() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).alsa) as usize - ptr as usize
            },
            188usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config),
                "::",
                stringify!(alsa)
            )
        );
    }
    test_field_alsa();
    fn test_field_pulse() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pulse) as usize - ptr as usize
            },
            208usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config),
                "::",
                stringify!(pulse)
            )
        );
    }
    test_field_pulse();
    fn test_field_coreaudio() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).coreaudio) as usize - ptr as usize
            },
            224usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config),
                "::",
                stringify!(coreaudio)
            )
        );
    }
    test_field_coreaudio();
    fn test_field_opensl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).opensl) as usize - ptr as usize
            },
            228usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config),
                "::",
                stringify!(opensl)
            )
        );
    }
    test_field_opensl();
    fn test_field_aaudio() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).aaudio) as usize - ptr as usize
            },
            236usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_config),
                "::",
                stringify!(aaudio)
            )
        );
    }
    test_field_aaudio();
}
pub type ma_enum_devices_callback_proc = ::std::option::Option<
    unsafe extern "C" fn(
        pContext: *mut ma_context,
        deviceType: ma_device_type,
        pInfo: *const ma_device_info,
        pUserData: *mut ::std::os::raw::c_void,
    ) -> ma_bool32,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_device_descriptor {
    pub pDeviceID: *const ma_device_id,
    pub shareMode: ma_share_mode,
    pub format: ma_format,
    pub channels: ma_uint32,
    pub sampleRate: ma_uint32,
    pub channelMap: [ma_channel; 32usize],
    pub periodSizeInFrames: ma_uint32,
    pub periodSizeInMilliseconds: ma_uint32,
    pub periodCount: ma_uint32,
}
#[test]
fn bindgen_test_layout_ma_device_descriptor() {
    assert_eq!(
        ::std::mem::size_of::<ma_device_descriptor>(),
        72usize,
        concat!("Size of: ", stringify!(ma_device_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_device_descriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_device_descriptor))
    );
    fn test_field_pDeviceID() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_descriptor>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pDeviceID) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_descriptor),
                "::",
                stringify!(pDeviceID)
            )
        );
    }
    test_field_pDeviceID();
    fn test_field_shareMode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_descriptor>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shareMode) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_descriptor),
                "::",
                stringify!(shareMode)
            )
        );
    }
    test_field_shareMode();
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_descriptor>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_descriptor),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_channels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_descriptor>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channels) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_descriptor),
                "::",
                stringify!(channels)
            )
        );
    }
    test_field_channels();
    fn test_field_sampleRate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_descriptor>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_descriptor),
                "::",
                stringify!(sampleRate)
            )
        );
    }
    test_field_sampleRate();
    fn test_field_channelMap() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_descriptor>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).channelMap) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_descriptor),
                "::",
                stringify!(channelMap)
            )
        );
    }
    test_field_channelMap();
    fn test_field_periodSizeInFrames() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_descriptor>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).periodSizeInFrames) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_descriptor),
                "::",
                stringify!(periodSizeInFrames)
            )
        );
    }
    test_field_periodSizeInFrames();
    fn test_field_periodSizeInMilliseconds() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_descriptor>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).periodSizeInMilliseconds) as usize - ptr as usize
            },
            60usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_descriptor),
                "::",
                stringify!(periodSizeInMilliseconds)
            )
        );
    }
    test_field_periodSizeInMilliseconds();
    fn test_field_periodCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_device_descriptor>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).periodCount) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_device_descriptor),
                "::",
                stringify!(periodCount)
            )
        );
    }
    test_field_periodCount();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_backend_callbacks {
    pub onContextInit: ::std::option::Option<
        unsafe extern "C" fn(
            pContext: *mut ma_context,
            pConfig: *const ma_context_config,
            pCallbacks: *mut ma_backend_callbacks,
        ) -> ma_result,
    >,
    pub onContextUninit:
        ::std::option::Option<unsafe extern "C" fn(pContext: *mut ma_context) -> ma_result>,
    pub onContextEnumerateDevices: ::std::option::Option<
        unsafe extern "C" fn(
            pContext: *mut ma_context,
            callback: ma_enum_devices_callback_proc,
            pUserData: *mut ::std::os::raw::c_void,
        ) -> ma_result,
    >,
    pub onContextGetDeviceInfo: ::std::option::Option<
        unsafe extern "C" fn(
            pContext: *mut ma_context,
            deviceType: ma_device_type,
            pDeviceID: *const ma_device_id,
            pDeviceInfo: *mut ma_device_info,
        ) -> ma_result,
    >,
    pub onDeviceInit: ::std::option::Option<
        unsafe extern "C" fn(
            pDevice: *mut ma_device,
            pConfig: *const ma_device_config,
            pDescriptorPlayback: *mut ma_device_descriptor,
            pDescriptorCapture: *mut ma_device_descriptor,
        ) -> ma_result,
    >,
    pub onDeviceUninit:
        ::std::option::Option<unsafe extern "C" fn(pDevice: *mut ma_device) -> ma_result>,
    pub onDeviceStart:
        ::std::option::Option<unsafe extern "C" fn(pDevice: *mut ma_device) -> ma_result>,
    pub onDeviceStop:
        ::std::option::Option<unsafe extern "C" fn(pDevice: *mut ma_device) -> ma_result>,
    pub onDeviceRead: ::std::option::Option<
        unsafe extern "C" fn(
            pDevice: *mut ma_device,
            pFrames: *mut ::std::os::raw::c_void,
            frameCount: ma_uint32,
            pFramesRead: *mut ma_uint32,
        ) -> ma_result,
    >,
    pub onDeviceWrite: ::std::option::Option<
        unsafe extern "C" fn(
            pDevice: *mut ma_device,
            pFrames: *const ::std::os::raw::c_void,
            frameCount: ma_uint32,
            pFramesWritten: *mut ma_uint32,
        ) -> ma_result,
    >,
    pub onDeviceAudioThread:
        ::std::option::Option<unsafe extern "C" fn(pDevice: *mut ma_device) -> ma_result>,
}
#[test]
fn bindgen_test_layout_ma_backend_callbacks() {
    assert_eq!(
        ::std::mem::size_of::<ma_backend_callbacks>(),
        88usize,
        concat!("Size of: ", stringify!(ma_backend_callbacks))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_backend_callbacks>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_backend_callbacks))
    );
    fn test_field_onContextInit() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_backend_callbacks>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).onContextInit) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_backend_callbacks),
                "::",
                stringify!(onContextInit)
            )
        );
    }
    test_field_onContextInit();
    fn test_field_onContextUninit() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_backend_callbacks>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).onContextUninit) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_backend_callbacks),
                "::",
                stringify!(onContextUninit)
            )
        );
    }
    test_field_onContextUninit();
    fn test_field_onContextEnumerateDevices() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_backend_callbacks>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).onContextEnumerateDevices) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_backend_callbacks),
                "::",
                stringify!(onContextEnumerateDevices)
            )
        );
    }
    test_field_onContextEnumerateDevices();
    fn test_field_onContextGetDeviceInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_backend_callbacks>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).onContextGetDeviceInfo) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_backend_callbacks),
                "::",
                stringify!(onContextGetDeviceInfo)
            )
        );
    }
    test_field_onContextGetDeviceInfo();
    fn test_field_onDeviceInit() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_backend_callbacks>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).onDeviceInit) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_backend_callbacks),
                "::",
                stringify!(onDeviceInit)
            )
        );
    }
    test_field_onDeviceInit();
    fn test_field_onDeviceUninit() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_backend_callbacks>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).onDeviceUninit) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_backend_callbacks),
                "::",
                stringify!(onDeviceUninit)
            )
        );
    }
    test_field_onDeviceUninit();
    fn test_field_onDeviceStart() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_backend_callbacks>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).onDeviceStart) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_backend_callbacks),
                "::",
                stringify!(onDeviceStart)
            )
        );
    }
    test_field_onDeviceStart();
    fn test_field_onDeviceStop() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_backend_callbacks>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).onDeviceStop) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_backend_callbacks),
                "::",
                stringify!(onDeviceStop)
            )
        );
    }
    test_field_onDeviceStop();
    fn test_field_onDeviceRead() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_backend_callbacks>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).onDeviceRead) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_backend_callbacks),
                "::",
                stringify!(onDeviceRead)
            )
        );
    }
    test_field_onDeviceRead();
    fn test_field_onDeviceWrite() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_backend_callbacks>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).onDeviceWrite) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_backend_callbacks),
                "::",
                stringify!(onDeviceWrite)
            )
        );
    }
    test_field_onDeviceWrite();
    fn test_field_onDeviceAudioThread() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_backend_callbacks>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).onDeviceAudioThread) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_backend_callbacks),
                "::",
                stringify!(onDeviceAudioThread)
            )
        );
    }
    test_field_onDeviceAudioThread();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_context_config {
    pub logCallback: ma_log_proc,
    pub threadPriority: ma_thread_priority,
    pub threadStackSize: usize,
    pub pUserData: *mut ::std::os::raw::c_void,
    pub allocationCallbacks: ma_allocation_callbacks,
    pub alsa: ma_context_config__bindgen_ty_1,
    pub pulse: ma_context_config__bindgen_ty_2,
    pub coreaudio: ma_context_config__bindgen_ty_3,
    pub jack: ma_context_config__bindgen_ty_4,
    pub custom: ma_backend_callbacks,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_context_config__bindgen_ty_1 {
    pub useVerboseDeviceEnumeration: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_context_config__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<ma_context_config__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(ma_context_config__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_context_config__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_context_config__bindgen_ty_1))
    );
    fn test_field_useVerboseDeviceEnumeration() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_context_config__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).useVerboseDeviceEnumeration) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_context_config__bindgen_ty_1),
                "::",
                stringify!(useVerboseDeviceEnumeration)
            )
        );
    }
    test_field_useVerboseDeviceEnumeration();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_context_config__bindgen_ty_2 {
    pub pApplicationName: *const ::std::os::raw::c_char,
    pub pServerName: *const ::std::os::raw::c_char,
    pub tryAutoSpawn: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_context_config__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<ma_context_config__bindgen_ty_2>(),
        24usize,
        concat!("Size of: ", stringify!(ma_context_config__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_context_config__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_context_config__bindgen_ty_2))
    );
    fn test_field_pApplicationName() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_context_config__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pApplicationName) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_context_config__bindgen_ty_2),
                "::",
                stringify!(pApplicationName)
            )
        );
    }
    test_field_pApplicationName();
    fn test_field_pServerName() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_context_config__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pServerName) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_context_config__bindgen_ty_2),
                "::",
                stringify!(pServerName)
            )
        );
    }
    test_field_pServerName();
    fn test_field_tryAutoSpawn() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_context_config__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tryAutoSpawn) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_context_config__bindgen_ty_2),
                "::",
                stringify!(tryAutoSpawn)
            )
        );
    }
    test_field_tryAutoSpawn();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_context_config__bindgen_ty_3 {
    pub sessionCategory: ma_ios_session_category,
    pub sessionCategoryOptions: ma_uint32,
    pub noAudioSessionActivate: ma_bool32,
    pub noAudioSessionDeactivate: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_context_config__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<ma_context_config__bindgen_ty_3>(),
        16usize,
        concat!("Size of: ", stringify!(ma_context_config__bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_context_config__bindgen_ty_3>(),
        4usize,
        concat!("Alignment of ", stringify!(ma_context_config__bindgen_ty_3))
    );
    fn test_field_sessionCategory() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_context_config__bindgen_ty_3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sessionCategory) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_context_config__bindgen_ty_3),
                "::",
                stringify!(sessionCategory)
            )
        );
    }
    test_field_sessionCategory();
    fn test_field_sessionCategoryOptions() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_context_config__bindgen_ty_3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sessionCategoryOptions) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_context_config__bindgen_ty_3),
                "::",
                stringify!(sessionCategoryOptions)
            )
        );
    }
    test_field_sessionCategoryOptions();
    fn test_field_noAudioSessionActivate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_context_config__bindgen_ty_3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).noAudioSessionActivate) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_context_config__bindgen_ty_3),
                "::",
                stringify!(noAudioSessionActivate)
            )
        );
    }
    test_field_noAudioSessionActivate();
    fn test_field_noAudioSessionDeactivate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_context_config__bindgen_ty_3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).noAudioSessionDeactivate) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_context_config__bindgen_ty_3),
                "::",
                stringify!(noAudioSessionDeactivate)
            )
        );
    }
    test_field_noAudioSessionDeactivate();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_context_config__bindgen_ty_4 {
    pub pClientName: *const ::std::os::raw::c_char,
    pub tryStartServer: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_context_config__bindgen_ty_4() {
    assert_eq!(
        ::std::mem::size_of::<ma_context_config__bindgen_ty_4>(),
        16usize,
        concat!("Size of: ", stringify!(ma_context_config__bindgen_ty_4))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_context_config__bindgen_ty_4>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_context_config__bindgen_ty_4))
    );
    fn test_field_pClientName() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_context_config__bindgen_ty_4>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pClientName) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_context_config__bindgen_ty_4),
                "::",
                stringify!(pClientName)
            )
        );
    }
    test_field_pClientName();
    fn test_field_tryStartServer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_context_config__bindgen_ty_4>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tryStartServer) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_context_config__bindgen_ty_4),
                "::",
                stringify!(tryStartServer)
            )
        );
    }
    test_field_tryStartServer();
}
#[test]
fn bindgen_test_layout_ma_context_config() {
    assert_eq!(
        ::std::mem::size_of::<ma_context_config>(),
        216usize,
        concat!("Size of: ", stringify!(ma_context_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ma_context_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ma_context_config))
    );
    fn test_field_logCallback() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_context_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).logCallback) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_context_config),
                "::",
                stringify!(logCallback)
            )
        );
    }
    test_field_logCallback();
    fn test_field_threadPriority() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_context_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).threadPriority) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_context_config),
                "::",
                stringify!(threadPriority)
            )
        );
    }
    test_field_threadPriority();
    fn test_field_threadStackSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_context_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).threadStackSize) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_context_config),
                "::",
                stringify!(threadStackSize)
            )
        );
    }
    test_field_threadStackSize();
    fn test_field_pUserData() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_context_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pUserData) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_context_config),
                "::",
                stringify!(pUserData)
            )
        );
    }
    test_field_pUserData();
    fn test_field_allocationCallbacks() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_context_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).allocationCallbacks) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_context_config),
                "::",
                stringify!(allocationCallbacks)
            )
        );
    }
    test_field_allocationCallbacks();
    fn test_field_alsa() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_context_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).alsa) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_context_config),
                "::",
                stringify!(alsa)
            )
        );
    }
    test_field_alsa();
    fn test_field_pulse() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_context_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pulse) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_context_config),
                "::",
                stringify!(pulse)
            )
        );
    }
    test_field_pulse();
    fn test_field_coreaudio() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_context_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).coreaudio) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_context_config),
                "::",
                stringify!(coreaudio)
            )
        );
    }
    test_field_coreaudio();
    fn test_field_jack() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_context_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).jack) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_context_config),
                "::",
                stringify!(jack)
            )
        );
    }
    test_field_jack();
    fn test_field_custom() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ma_context_config>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).custom) as usize - ptr as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(ma_context_config),
                "::",
                stringify!(custom)
            )
        );
    }
    test_field_custom();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ma_context {
    pub callbacks: ma_backend_callbacks,
    pub backend: ma_backend,
    pub logCallback: ma_log_proc,
    pub threadPriority: ma_thread_priority,
    pub threadStackSize: usize,
    pub pUserData: *mut ::std::os::raw::c_void,
    pub allocationCallbacks: ma_allocation_callbacks,
    pub deviceEnumLock: ma_mutex,
    pub deviceInfoLock: ma_mutex,
    pub deviceInfoCapacity: ma_uint32,
    pub playbackDeviceInfoCount: ma_uint32,
    pub captureDeviceInfoCount: ma_uint32,
    pub pDeviceInfos: *mut ma_device_info,
    pub isBackendAsynchronous: ma_bool8,
    pub onUninit:
        ::std::option::Option<unsafe extern "C" fn(pContext: *mut ma_context) -> ma_result>,
    pub onEnumDevices: ::std::option::Option<
        unsafe extern "C" fn(
            pContext: *mut ma_context,
            callback: ma_enum_devices_callback_proc,
            pUserData: *mut ::std::os::raw::c_void,
        ) -> ma_result,
    >,
    pub onGetDeviceInfo: ::std::option::Option<
        unsafe extern "C" fn(
            pContext: *mut ma_context,
            deviceType: ma_device_type,
            pDeviceID: *const ma_device_id,
            shareMode: ma_share_mode,
            pDeviceInfo: *mut ma_device_info,
        ) -> ma_result,
    >,
    pub onDeviceInit: ::std::option::Option<
        unsafe extern "C" fn(
            pContext: *mut ma_context,
            pConfig: *const ma_device_config,
            pDevice: *mut ma_device,
        ) -> ma_result,
    >,
    pub onDeviceUninit: ::std::option::Option<unsafe extern "C" fn(pDevice: *mut ma_device)>,
    pub onDeviceStart:
        ::std::option::Option<unsafe extern "C" fn(pDevice: *mut ma_device) -> ma_result>,
    pub onDeviceStop:
        ::std::option::Option<unsafe extern "C" fn(pDevice: *mut ma_device) -> ma_result>,
    pub onDeviceMainLoop:
        ::std::option::Option<unsafe extern "C" fn(pDevice: *mut ma_device) -> ma_result>,
    pub __bindgen_anon_1: ma_context__bindgen_ty_1,
    pub __bindgen_anon_2: ma_context__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ma_context__bindgen_ty_1 {
    pub coreaudio: ma_context__bindgen_ty_1__bindgen_ty_1,
    pub null_backend: ma_context__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ma_context__bindgen_ty_1__bindgen_ty_1 {
    pub hCoreFoundation: ma_handle,
    pub CFStringGetCString: ma_proc,
    pub CFRelease: ma_proc,
    pub hCoreAudio: ma_handle,
    pub AudioObjectGetPropertyData: ma_proc,
    pub AudioObjectGetPropertyDataSize: ma_proc,
    pub AudioObjectSetPropertyData: ma_proc,
    pub AudioObjectAddPropertyListener: ma_proc,
    pub AudioObjectRemovePropertyListener: ma_proc,
    pub hAudioUnit: ma_handle,
    pub AudioComponentFindNext: ma_proc,
    pub AudioComponentInstanceDispose: ma_proc,
    pub AudioComponentInstanceNew: ma_proc,
    pub AudioOutputUnitStart: ma_proc,
    pub AudioOutputUnitStop: ma_proc,
    pub AudioUnitAddPropertyListener: ma_proc,
    pub AudioUnitGetPropertyInfo: ma_proc,
    pub AudioUnitGetProperty: ma_proc,
    pub AudioUnitSetProperty: ma_proc,
    pub AudioUnitInitialize: ma_proc,
    pub AudioUnitRender: ma_proc,
    pub component: ma_ptr,
    pub noAudioSessionDeactivate: ma_bool32,
}
#[test]
fn bindgen_test_layout_ma_context__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<ma_context__bindgen_ty_1__bindgen_ty_1>(),
